{
  "names": [
    {
      "number": 1,
      "name": "Ar Rahmaan",
      "meaning": "The Most Compassionate",
      "appearances": "57 times in the Quran",
      "arabicText": "قُلِ ٱدۡعُواْ ٱللَّهَ أَوِ ٱدۡعُواْ ٱلرَّحۡمَٰنَۖ أَيّٗا مَّا تَدۡعُواْ فَلَهُ ٱلۡأَسۡمَآءُٱلۡحُسۡنَىٰۚ وَلَا تَجۡهَرۡ بِصَلَاتِكَ وَلَا تُخَافِتۡ بِهَا وَٱبۡتَغِ بَيۡنَ ذَٰلِكَسَبِيلٗا",
      "translation": "Say, \"Call upon Allah or call upon the Most Merciful. Whichever [name] you call – to Him belong the best names.\" And do not recite [too] loudly in your prayer or [too] quietly but seek between that an [intermediate] way.",
      "quranReference": "Quran (17:110)",
      "description": "The name Ar Rahman means that Allah possesses a mercy that is all-encompassing of everyone and everything, one with no bounds. This kind of mercy is only capable by Allah SWT."
    },
    {
      "number": 2,
      "name": "Ar Raheem",
      "meaning": "The Most Merciful",
      "appearances": "114 times in the Quran",
      "arabicText": "هُوَ ٱلَّذِي يُصَلِّي عَلَيۡكُمۡ وَمَلَـٰٓئِكَتُهُۥ لِيُخۡرِجَكُم مِّنَٱلظُّلُمَٰتِ إِلَى ٱلنُّورِۚ وَكَانَ بِٱلۡمُؤۡمِنِينَ رَحِيمٗا",
      "translation": "It is He who confers blessing upon you, and His angels [ask Him to do so] that He may bring you out from darknesses into the light. And ever is He, to the believers, Merciful.",
      "quranReference": "Quran (33:43)",
      "description": "The name Ar Raheem represents a special kind of mercy that Allah reserves for the believers or Muslims.",
      "additionalInfo": "A hadith about Allah's mercy: \"Verily, Allah has one hundred portions of mercy. From one portion the creation has been given mercy by virtue of which there is mutual love between the people and ninety nine portions are reserved for the Day of Resurrection.\""
    },
    {
      "number": 3,
      "name": "Al Malik",
      "meaning": "The King",
      "appearances": "5 times in the Quran",
      "arabicText": "فَتَعَٰلَى ٱللَّهُ ٱلۡمَلِكُ ٱلۡحَقُّۗ وَلَا تَعۡجَلۡ بِٱلۡقُرۡءَانِ مِن قَبۡلِ أَنيُقۡضَىٰٓ إِلَيۡكَ وَحۡيُهُۥۖ وَقُل رَّبِّ زِدۡنِي عِلۡمٗا",
      "translation": "So high [above all] is Allah, the Sovereign, the Truth. And, [O Muhammad], do not hasten with [recitation of] the Qur'an before its revelation is completed to you, and say, \"My Lord, increase me in knowledge.\"",
      "quranReference": "Quran (20:114)",
      "description": "The name Al Malik signifies that Allah has complete knowledge, power, and control over all of his creations. It also implies that Allah is independent and does not need anyone's assistance, whereas we are constantly in need of His help."
    },
    {
      "number": 4,
      "name": "Al Quddoos",
      "meaning": "The Most Sacred",
      "appearances": "",
      "arabicText": "هُوَ ٱللَّهُ ٱلَّذِي لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡمَلِكُ ٱلۡقُدُّوسُ ٱلسَّلَٰمُ ٱلۡمُؤۡمِنُٱلۡمُهَيۡمِنُ ٱلۡعَزِيزُ ٱلۡجَبَّارُ ٱلۡمُتَكَبِّرُۚ سُبۡحَٰنَ ٱللَّهِ عَمَّا يُشۡرِكُونَ",
      "translation": "He is Allah, other than whom there is no deity, the Sovereign, the Pure, the Perfection, the Bestower of Faith, the Overseer, the Exalted in Might, the Compeller, the Superior. Exalted is Allah above whatever they associate with Him.",
      "quranReference": "Quran (59:23)",
      "description": "The name Al Quddus tells us that Allah is free of any flaws or imperfections and doesn't make any mistakes. It reminds us that we are in need of purification and must seek forgiveness from Him, who is the most pure.",
      "additionalInfo": "According to Aisha RA, when in rukuh and sajdah in prayer, the Prophet Muhammad SAW used to recite the dua: سبوح قدوس رب الملائكة والروح (Subbuhun, Quddusun, Rabbul-malaa'ikati warruh) - Glory (to You), Most Holy (are You), Lord of the angels and the Spirit - Sahih Muslim 487a"
    },
    {
      "number": 5,
      "name": "As Salaam",
      "meaning": "The Source of Peace",
      "appearances": "",
      "arabicText": "هُوَ ٱللَّهُ ٱلَّذِي لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡمَلِكُ ٱلۡقُدُّوسُ ٱلسَّلَٰمُ ٱلۡمُؤۡمِنُٱلۡمُهَيۡمِنُ ٱلۡعَزِيزُ ٱلۡجَبَّارُ ٱلۡمُتَكَبِّرُۚ سُبۡحَٰنَ ٱللَّهِ عَمَّا يُشۡرِكُونَ",
      "translation": "He is Allah, other than whom there is no deity, the Sovereign, the Pure, the Perfection, the Bestower of Faith, the Overseer, the Exalted in Might, the Compeller, the Superior. Exalted is Allah above whatever they associate with Him.",
      "quranReference": "Quran (59:23)",
      "description": "The name As Salaam shows that Allah is the one who grants peace and security to all of His creations.",
      "additionalInfo": "A dua to recite after salah: أَسْـتَغْفِرُ الله (ثَلاثاً) اللّهُـمَّ أَنْـتَ السَّلامُ وَمِـنْكَ السَّلامتَبارَكْتَ يا ذا الجَـلالِ وَالإِكْـرام (\"I seek the forgiveness of Allah (three times). O Allah, You are Peace and from You comes peace. Blessed are You, O Owner of majesty and honor.\")"
    },
    {
      "number": 6,
      "name": "Al Mu'min",
      "meaning": "The Infuser of Faith",
      "appearances": "",
      "arabicText": "هُوَ ٱللَّهُ ٱلَّذِي لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡمَلِكُ ٱلۡقُدُّوسُ ٱلسَّلَٰمُ ٱلۡمُؤۡمِنُٱلۡمُهَيۡمِنُ ٱلۡعَزِيزُ ٱلۡجَبَّارُ ٱلۡمُتَكَبِّرُۚ سُبۡحَٰنَ ٱللَّهِ عَمَّا يُشۡرِكُونَ",
      "translation": "He is Allah, other than whom there is no deity, the Sovereign, the Pure, the Perfection, the Bestower of Faith, the Overseer, the Exalted in Might, the Compeller, the Superior. Exalted is Allah above whatever they associate with Him.",
      "quranReference": "Quran (59:23)",
      "description": "The name Al Mu'min shows us that Allah is the one who provides us with justice and security. He always fulfills His promises and never punishes unfairly. We must always have faith in Allah since He is the only one who can protect us from any kind of harm or adversity."
    },
    {
      "number": 7,
      "name": "Al Muhaymin",
      "meaning": "The Guardian",
      "appearances": "",
      "arabicText": "هُوَ ٱللَّهُ ٱلَّذِي لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡمَلِكُ ٱلۡقُدُّوسُ ٱلسَّلَٰمُ ٱلۡمُؤۡمِنُٱلۡمُهَيۡمِنُ ٱلۡعَزِيزُ ٱلۡجَبَّارُ ٱلۡمُتَكَبِّرُۚ سُبۡحَٰنَ ٱللَّهِ عَمَّا يُشۡرِكُونَ",
      "translation": "He is Allah, other than whom there is no deity, the Sovereign, the Pure, the Perfection, the Bestower of Faith, the Overseer, the Exalted in Might, the Compeller, the Superior. Exalted is Allah above whatever they associate with Him.",
      "quranReference": "Quran (59:23)",
      "description": "The name Al Muhaymin indicates that Allah is our overseer and protector. This means that He is able to see all of our secrets and what is concealed in our hearts. This name evokes a sense of unlimited guardianship and control in the form of an authoritative figure who we can trust to keep our best interests in mind."
    },
    {
      "number": 8,
      "name": "Al 'Azeez",
      "meaning": "The Mighty One",
      "appearances": "90 times in the Quran, often paired with another name",
      "arabicText": "فَالِقُ ٱلۡإِصۡبَاحِ وَجَعَلَ ٱلَّيۡلَ سَكَنٗا وَٱلشَّمۡسَ وَٱلۡقَمَرَ حُسۡبَانٗاۚذَٰلِكَ تَقۡدِيرُ ٱلۡعَزِيزِ ٱلۡعَلِيمِ",
      "translation": "[He is] the cleaver of daybreak and has made the night for rest and the sun and moon for calculation. That is the determination of the Exalted in Might, the Knowing.",
      "quranReference": "Quran (6:96)",
      "description": "The name Al 'Azeez reminds us that Allah is the most powerful and is able to subdue any of His creations that oppose Him. We can mention this name in our duas when asking Allah for any sort of worldly opportunities or statuses, but also to enunciate our humility in comparison to Him."
    },
    {
      "number": 9,
      "name": "Al Jabbaar",
      "meaning": "The All-Compelling",
      "appearances": "",
      "arabicText": "هُوَ ٱللَّهُ ٱلَّذِي لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡمَلِكُ ٱلۡقُدُّوسُ ٱلسَّلَٰمُ ٱلۡمُؤۡمِنُٱلۡمُهَيۡمِنُ ٱلۡعَزِيزُ ٱلۡجَبَّارُ ٱلۡمُتَكَبِّرُۚ سُبۡحَٰنَ ٱللَّهِ عَمَّا يُشۡرِكُونَ",
      "translation": "He is Allah, other than whom there is no deity, the Sovereign, the Pure, the Perfection, the Bestower of Faith, the Overseer, the Exalted in Might, the Compeller, the Superior. Exalted is Allah above whatever they associate with Him.",
      "quranReference": "Quran (59:23)",
      "description": "As the All-Compelling, Allah is the one who decides anything that happens in our lives. As He said in Surah Yaseen, when Allah intends something to occur, He only has to say \"be\" and it is. However, the second meaning of the name Al Jabbar is the Restorer, meaning that Allah can repair or restore anything that is out of order, even if it seems to be impossible. Thus, we should use this name when supplicating to Allah about anything that we need Him to fix when a situation seems beyond our control.",
      "additionalInfo": "A dua with this name was recited by the Prophet Muhammad SAW between two sajdahs in prayer: اللّهُـمَّ اغْفِـرْ لي وَارْحَمْـني وَاهْدِنـي وَاجْبُرْنـي وَعافِنـي وَارْزُقْنـي وَارْفَعْـني (\"O Allah forgive me, have mercy on me, guide me, support me, protect me, provide for me, and elevate me.\")"
    },
    {
      "number": 10,
      "name": "Al Mutakabbir",
      "meaning": "The Dominant One",
      "appearances": "",
      "arabicText": "هُوَ ٱللَّهُ ٱلَّذِي لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡمَلِكُ ٱلۡقُدُّوسُ ٱلسَّلَٰمُ ٱلۡمُؤۡمِنُٱلۡمُهَيۡمِنُ ٱلۡعَزِيزُ ٱلۡجَبَّارُ ٱلۡمُتَكَبِّرُۚ سُبۡحَٰنَ ٱللَّهِ عَمَّا يُشۡرِكُونَ",
      "translation": "He is Allah, other than whom there is no deity, the Sovereign, the Pure, the Perfection, the Bestower of Faith, the Overseer, the Exalted in Might, the Compeller, the Superior. Exalted is Allah above whatever they associate with Him.",
      "quranReference": "Quran (59:23)",
      "description": "The name Al Mutakabbir implies that Allah is proud and is vastly supreme over all of His creation. He alone possesses true greatness and no one can compete with Him. We can rely on Allah when we are faced with an obstacle that seems impossible to overcome since He excels at everything."
    },
    {
      "number": 11,
      "name": "Al Khaaliq",
      "meaning": "The Creator",
      "appearances": "8 times in the Quran",
      "arabicText": "ثُمَّ خَلَقۡنَا ٱلنُّطۡفَةَ عَلَقَةٗ فَخَلَقۡنَا ٱلۡعَلَقَةَ مُضۡغَةٗ فَخَلَقۡنَاٱلۡمُضۡغَةَ عِظَٰمٗا فَكَسَوۡنَا ٱلۡعِظَٰمَ لَحۡمٗا ثُمَّ أَنشَأۡنَٰهُ خَلۡقًا ءَاخَرَۚفَتَبَارَكَ ٱللَّهُ أَحۡسَنُ ٱلۡخَٰلِقِينَ",
      "translation": "Then We made the sperm-drop into a clinging clot, and We made the clot into a lump [of flesh], and We made [from] the lump, bones, and We covered the bones with flesh; then We developed him into another creation. So blessed is Allah, the best of creators.",
      "quranReference": "Quran (23:14)",
      "description": "The name Al Khaaliq is one of the three names of creation, in addition to Al Bari (The Producer) and Al Musawwir (The Fashioner). The analogy of Imam Ghazali likens these names to the roles of constructing a house; you have the planner, the builder, and the designer. This is synonymous to how Allah performs all of these roles on an infinite scale. He can create everything from nothingness, whereas we can only transform the resources He has provided us for our creative purposes."
    },
    {
      "number": 12,
      "name": "Al Baari'",
      "meaning": "The Maker",
      "appearances": "",
      "arabicText": "هُوَ ٱللَّهُ ٱلۡخَٰلِقُ ٱلۡبَارِئُ ٱلۡمُصَوِّرُۖ لَهُ ٱلۡأَسۡمَآءُ ٱلۡحُسۡنَىٰۚ يُسَبِّحُلَهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ",
      "translation": "He is Allah, the Creator, the Inventor, the Fashioner; to Him belong the best names. Whatever is in the heavens and earth is exalting Him. And He is the Exalted in Might, the Wise.",
      "quranReference": "Quran (59:24)",
      "description": "The name Al Baari' is meant to describe another aspect of Allah's ability as the Creator, as mentioned in the description of the previous name. Allah is able to manifest all of His creations from nothing in a way that is perfect and flawless. We can reflect that no matter what insecurities we have, we should be thankful for the bodies that Allah has given us. We must learn to respect and take care of ourselves since our bodies are a gift from Allah and we were created exactly how Allah intended, without any mistakes."
    },
    {
      "number": 13,
      "name": "Al Musawwir",
      "meaning": "The Fashioner",
      "appearances": "",
      "arabicText": "هُوَ ٱللَّهُ ٱلۡخَٰلِقُ ٱلۡبَارِئُ ٱلۡمُصَوِّرُۖ لَهُ ٱلۡأَسۡمَآءُ ٱلۡحُسۡنَىٰۚ يُسَبِّحُلَهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ",
      "translation": "He is Allah, the Creator, the Inventor, the Fashioner; to Him belong the best names. Whatever is in the heavens and earth is exalting Him. And He is the Exalted in Might, the Wise.",
      "quranReference": "Quran (59:24)",
      "description": "The name Al Musawwir is meant to describe another aspect of Allah's ability as the Creator, as mentioned in the description of the previous two names. This name indicates that Allah is the one who perfectly proportions and balances all of His creations."
    },
    {
      "number": 14,
      "name": "Al Ghaffaar",
      "meaning": "The Ever Forgiving",
      "appearances": "",
      "arabicText": "خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ بِٱلۡحَقِّۖ يُكَوِّرُ ٱلَّيۡلَ عَلَى ٱلنَّهَارِوَيُكَوِّرُ ٱلنَّهَارَ عَلَى ٱلَّيۡلِۖ وَسَخَّرَ ٱلشَّمۡسَ وَٱلۡقَمَرَۖ كُلّٞ يَجۡرِيلِأَجَلٖ مُّسَمًّىۗ أَلَا هُوَ ٱلۡعَزِيزُ ٱلۡغَفَّـٰرُ",
      "translation": "He created the heavens and earth in truth. He wraps the night over the day and wraps the day over the night and has subjected the sun and the moon, each running [its course] for a specified term. Unquestionably, He is the Exalted in Might, the Perpetual Forgiver.",
      "quranReference": "Quran (39:5)",
      "description": "The name Al Ghaffaar shows that Allah loves to forgive those who seek forgiveness. No matter how daunting the sin may seem, one should never feel hopeless since Allah's mercy is vast.",
      "additionalInfo": "Anas (May Allah be pleased with him) reported: Messenger of Allah ﷺ said, \"Allah, the Exalted, has said: 'O son of adam, I forgive you as long as you pray to Me and hope for My forgiveness, whatever sins you have committed. O son of 'Adam, I do not care if your sins reach the height of the heaven, then you ask for my forgiveness, I would forgive you. O son of 'Adam, if you come to Me with an earth load of sins, and meet Me associating nothing to Me, I would match it with an earthload of forgiveness.'\" - Riyad as-Salihin 442"
    },
    {
      "number": 15,
      "name": "Al Qahhaar",
      "meaning": "The All Prevailing",
      "appearances": "6 times in the Quran",
      "arabicText": "يَوۡمَ هُم بَٰرِزُونَۖ لَا يَخۡفَىٰ عَلَى ٱللَّهِ مِنۡهُمۡ شَيۡءٞۚ لِّمَنِ ٱلۡمُلۡكُٱلۡيَوۡمَۖ لِلَّهِ ٱلۡوَٰحِدِ ٱلۡقَهَّارِ",
      "translation": "The Day they come forth nothing concerning them will be concealed from Allah. To whom belongs [all] sovereignty this Day? To Allah, the One, the Prevailing.",
      "quranReference": "Quran (40:16)",
      "description": "The name Al Qahhaar means that Allah has complete dominance over everything. It is always paired with the name Al Waahid (The One) in the Quran. This shows that unlike a worldly king whose power could easily be overthrown by the people, Allah is the only one who possesses this kind of dominance and power over all His creations. When using this name of Allah in your duas, you can feel reassured that you have the support and assistance of the most powerful."
    },
    {
      "number": 16,
      "name": "Al Wahhaab",
      "meaning": "The Supreme Bestower",
      "appearances": "3 times in the Quran",
      "arabicText": "أَمۡ عِندَهُمۡ خَزَآئِنُ رَحۡمَةِ رَبِّكَ ٱلۡعَزِيزِ ٱلۡوَهَّابِ",
      "translation": "Do they possess the treasures of your Lord, the Most Mighty, the Great Bestower?",
      "quranReference": "Quran (38:9)",
      "description": "The name Al Wahhaab means that Allah is so abundantly generous without ever having to keep track of what He is giving us. Allah's capacity to give is bountiful and endless and He gives without interests or returns. As said in Surah Ibrahim ayat 34, \"And if you should count the favor of Allah, you could not enumerate them. Indeed, mankind is [generally] most unjust and ungrateful.\" We should reflect about the endless blessings that Allah has given us and keep in mind that all of our success has only been made possible by Him. We are definitely undeserving of the boundless favors Allah has given us and we should always strive to be grateful to Him."
    },
    {
      "number": 17,
      "name": "Ar Razzaaq",
      "meaning": "The Provider",
      "appearances": "3 times in the Quran",
      "arabicText": "وَمَا خَلَقْتُ ٱلْجِنَّ وَٱلْإِنسَ إِلَّا لِيَعْبُدُونِ مَآ أُرِيدُ مِنْهُم مِّن رِّزْقٍۢ وَمَآ أُرِيدُ أَن يُطْعِمُونِ إِنَّ ٱللَّهَ هُوَ ٱلرَّزَّاقُ ذُو ٱلْقُوَّةِ ٱلْمَتِينُ",
      "translation": "And I did not create the jinn and mankind except to worship Me. I do not want from them any provision, nor do I want them to feed Me. Indeed, it is Allah who is the [continual] Provider, the firm possessor of strength.",
      "quranReference": "Quran (51:56-58)",
      "description": "The name Ar Razzaaq means that Allah is the provider of sustenance. The difference between this name and the previous one, Al Wahhaab, is that while the latter represents Allah's ability to give us gifts without any effort on our part, this name demonstrates Allah's attribute of giving us rizq. Rizq can be considered as general sustenance such as wealth, or as spiritual sustenance. In either case, receiving rizq requires effort on our part, whether it is in the form of making dua or physical effort."
    },
    {
      "number": 18,
      "name": "Al Fattaah",
      "meaning": "The Opener",
      "appearances": "",
      "arabicText": "قُلْ يَجْمَعُ بَيْنَنَا رَبُّنَا ثُمَّ يَفْتَحُ بَيْنَنَا بِٱلْحَقِّ وَهُوَ ٱلْفَتَّاحُ ٱلْعَلِيمُ",
      "translation": "Say, 'Our Lord will bring us together; then He will judge between us in truth. And He is the Knowing Judge.'",
      "quranReference": "Quran (34:26)",
      "description": "The name Al Fattaah implies that not only is Allah the opener of provisions, but also of mercy. According to a Hadith, in Ramadan, Allah opens the gates of mercy and the gates of Hell are locked. Another meaning could be that Allah opens our minds to guidance and knowledge. He also tests us by opening opportunities, fame, or wealth for us to see how we respond to them.",
      "additionalInfo": "When we enter the masjid, the Prophet SAW recommended for us to recite the dua: اللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ (\"O Allah! Open for me the gates of Your mercy!\")"
    },
    {
      "number": 19,
      "name": "Al 'Aleem",
      "meaning": "The All Knowing",
      "appearances": "157 times in the Quran",
      "arabicText": "قَالُواْ سُبۡحَٰنَكَ لَا عِلۡمَ لَنَآ إِلَّا مَا عَلَّمۡتَنَآۖ إِنَّكَ أَنتَ ٱلۡعَلِيمُٱلۡحَكِيمُ",
      "translation": "They said, 'Exalted are You; we have no knowledge except what You have taught us. Indeed, it is You who is the Knowing, the Wise.'",
      "quranReference": "Quran (2:32)",
      "description": "The name Al 'Aleem means that Allah is aware of not only our outer actions, but also our inner thoughts and intentions that are in our hearts. Nothing can be hidden from Him and we must trust in His judgment in our affairs, since He is the most knowledgable of all of our circumstances and outcomes."
    },
    {
      "number": 20,
      "name": "Al Qaabid",
      "meaning": "The Withholder",
      "appearances": "Does not directly appear in the Quran, but is described in the Quran and appears in Hadiths",
      "arabicText": "مَّن ذَا ٱلَّذِى يُقْرِضُ ٱللَّهَ قَرْضًا حَسَنًۭا فَيُضَـٰعِفَهُۥ لَهُۥٓ أَضْعَافًۭاكَثِيرَةًۭ ۚ وَٱللَّهُ يَقْبِضُ وَيَبْصُۜطُ وَإِلَيْهِ تُرْجَعُونَ",
      "translation": "Who is it that would loan Allah a goodly loan so He may multiply it for him many times over? And it is Allah who withholds and grants abundance, and to Him you will be returned.",
      "quranReference": "Quran (2:245)",
      "description": "The name Al Qaabid is often paired with the name Al Baasit (The Expander), showing that Allah can both give and withhold according to His infinite wisdom. When He deems it necessary, Allah may withhold provision from us to test us. No matter how tragic our situation may seem to us, we must trust that Allah is doing everything for our wellbeing."
    },
    {
      "number": 21,
      "name": "Al Baasit",
      "meaning": "The Expander",
      "appearances": "Does not directly appear in the Quran but is described",
      "arabicText": "ٱللَّهُ يَبۡسُطُ ٱلرِّزۡقَ لِمَن يَشَآءُ وَيَقۡدِرُۚ وَفَرِحُواْ بِٱلۡحَيَوٰةِ ٱلدُّنۡيَاوَمَا ٱلۡحَيَوٰةُ ٱلدُّنۡيَا فِي ٱلۡأٓخِرَةِ إِلَّا مَتَٰعٞ",
      "translation": "Allah extends provision for whom He wills and restricts [it]. And they rejoice in the worldly life, while the worldly life is not, compared to the Hereafter, except [brief] enjoyment.",
      "quranReference": "Quran (13:26)",
      "description": "The name Al Baasit is a display of Allah's ability to give freely and infinitely, juxtaposing against the previous name, Al Qaabid (The Withholder). We can use this dua when supplicating to Allah concerning provision. However, we must keep in mind that we should not become overly excited during good times and saddened by tough times. We should be accepting and grateful during both times, since Allah gives and takes according to His wisdom."
    },
    {
      "number": 22,
      "name": "Al Khaafid",
      "meaning": "The Reducer",
      "appearances": "Does not directly appear in the Quran but is described",
      "arabicText": "خَافِضَةٌۭ رَّافِعَةٌ",
      "translation": "It will bring down [some] and raise up [others].",
      "quranReference": "Quran (56:3)",
      "description": "The name Al Khaafid describes how Allah is able to abase those who are overly proud, arrogant, or oppressive. One thing we should keep in mind is that just because Allah has reduced one's provision doesn't mean that He is humiliating them and if He increases one's provision, it doesn't necessarily mean that He is favoring them. Worldly success and the lack thereof don't translate to Allah's approval or disapproval, but are intended as a test for us. Allah wants to see whether we will abuse the resources we have been given or use them appropriately in Allah's cause, and if we will remain patient and grateful during times of scarcity."
    },
    {
      "number": 23,
      "name": "Ar Raafi'",
      "meaning": "The Elevator",
      "appearances": "Does not directly appear in the Quran but is described",
      "arabicText": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا قِيلَ لَكُمۡ تَفَسَّحُواْ فِي ٱلۡمَجَٰلِسِفَٱفۡسَحُواْ يَفۡسَحِ ٱللَّهُ لَكُمۡۖ وَإِذَا قِيلَ ٱنشُزُواْ فَٱنشُزُواْ يَرۡفَعِٱللَّهُ ٱلَّذِينَ ءَامَنُواْ مِنكُمۡ وَٱلَّذِينَ أُوتُواْ ٱلۡعِلۡمَ دَرَجَٰتٖۚ وَٱللَّهُبِمَا تَعۡمَلُونَ خَبِيرٞ",
      "translation": "O you who have believed, when you are told, \"Space yourselves\" in assemblies, then make space; Allah will make space for you. And when you are told, \"Arise,\" then arise; Allah will raise those who have believed among you and those who were given knowledge, by degrees. And Allah is Acquainted with what you do.",
      "quranReference": "Quran (58:11)",
      "description": "The name Ar Raafi' is the opposite of the previous name, Al Khaafid (The Reducer), and describes Allah's capability to increase someone in status, knowledge, or rizq."
    },
    {
      "number": 24,
      "name": "Al Mu'izz",
      "meaning": "The Honorer",
      "appearances": "Does not directly appear in the Quran but is described",
      "arabicText": "قُلِ ٱللَّهُمَّ مَـٰلِكَ ٱلْمُلْكِ تُؤْتِى ٱلْمُلْكَ مَن تَشَآءُ وَتَنزِعُ ٱلْمُلْكَمِمَّن تَشَآءُ وَتُعِزُّ مَن تَشَآءُ وَتُذِلُّ مَن تَشَآءُ ۖ بِيَدِكَ ٱلْخَيْرُ ۖإِنَّكَ عَلَىٰ كُلِّ شَىْءٍۢ قَدِيرٌۭ",
      "translation": "Say, 'O Allah, Owner of Sovereignty, You give sovereignty to whom You will and You take sovereignty away from whom You will. You honor whom You will and You humble whom You will. In Your hand is [all] good. Indeed, You are over all things competent.",
      "quranReference": "Quran (3:26)",
      "description": "The name Al Mu'izz describes Allah's attribute of being the only One who can grant us strength, rank, or influence. He also didn't bestow any sort of superiority based on a specific race or color of His creation, so we should not create any false sense of discrimination either."
    },
    {
      "number": 25,
      "name": "Al Mudhill",
      "meaning": "The Humiliator",
      "appearances": "Does not directly appear in the Quran but is described",
      "arabicText": "قُلِ ٱللَّهُمَّ مَـٰلِكَ ٱلْمُلْكِ تُؤْتِى ٱلْمُلْكَ مَن تَشَآءُ وَتَنزِعُ ٱلْمُلْكَمِمَّن تَشَآءُ وَتُعِزُّ مَن تَشَآءُ وَتُذِلُّ مَن تَشَآءُ ۖ بِيَدِكَ ٱلْخَيْرُ ۖإِنَّكَ عَلَىٰ كُلِّ شَىْءٍۢ قَدِيرٌۭ",
      "translation": "Say, 'O Allah, Owner of Sovereignty, You give sovereignty to whom You will and You take sovereignty away from whom You will. You honor whom You will and You humble whom You will. In Your hand is [all] good. Indeed, You are over all things competent.",
      "quranReference": "Quran (3:26)",
      "description": "The name Al Mudhill is the inverse of the previous name and indicates that Allah is also the one who has the ability to take away authority, sovereignty, or power from someone. Throughout the Quran, we can find multiple instances where Allah degraded those who transgressed and behaved in an oppressive manner, such as Firaun, Abu Lahab, and Iblees/Shaitan."
    },
    {
      "number": 26,
      "name": "As Samee'",
      "meaning": "The All Hearing",
      "appearances": "45 times in the Quran",
      "arabicText": "قُلْ إِن ضَلَلْتُ فَإِنَّمَآ أَضِلُّ عَلَىٰ نَفْسِى ۖ وَإِنِ ٱهْتَدَيْتُ فَبِمَايُوحِىٓ إِلَىَّ رَبِّىٓ ۚ إِنَّهُۥ سَمِيعٌۭ قَرِيبٌۭ",
      "translation": "Say, 'If I should err, I would only err against myself. But if I am guided, it is by what my Lord reveals to me. Indeed, He is Hearing and near.'",
      "quranReference": "Quran (34:26)",
      "description": "The name As Samee' characterizes Allah's ability to hear everything. From this attribute, we can learn that Allah can hear our hidden thoughts and all of the duas we make, even if they don't seem to be immediately granted. While humans often seek to be heard by others, Allah is always there to listen to us. In turn, we must reflect on whether we listen to what Allah has asked us to do. This name should encourage us to become better listeners ourselves. We should also be mindful of our words and actions since we know Allah is watching over us."
    },
    {
      "number": 27,
      "name": "Al Baseer",
      "meaning": "The All Seeing",
      "appearances": "42 times in the Quran",
      "arabicText": "إِنَّ ٱللَّهَ يَأۡمُرُكُمۡ أَن تُؤَدُّواْ ٱلۡأَمَٰنَٰتِ إِلَىٰٓ أَهۡلِهَا وَإِذَاحَكَمۡتُم بَيۡنَ ٱلنَّاسِ أَن تَحۡكُمُواْ بِٱلۡعَدۡلِۚ إِنَّ ٱللَّهَ نِعِمَّايَعِظُكُم بِهِۦٓۗ إِنَّ ٱللَّهَ كَانَ سَمِيعَۢا بَصِيرٗا",
      "translation": "Indeed, Allah commands you to render trusts to whom they are due and when you judge between people to judge with justice. Excellent is that which Allah instructs you. Indeed, Allah is ever Hearing and Seeing.",
      "quranReference": "Quran (4:58)",
      "description": "The name Al Baseer describes Allah's attribute of being aware of everything. Nothing escapes His attention, even actions we think we are committing in secret. Therefore, since we know He is watching us, we should be mindful of our actions."
    },
    {
      "number": 28,
      "name": "Al Hakam",
      "meaning": "The Impartial Judge",
      "appearances": "",
      "arabicText": "وَٱتَّبِعْ مَا يُوحَىٰٓ إِلَيْكَ وَٱصْبِرْ حَتَّىٰ يَحْكُمَ ٱللَّهُ ۚ وَهُوَ خَيْرُٱلْحَـٰكِمِينَ",
      "translation": "Allah will judge between you on the Day of Resurrection concerning that over which you used to differ.",
      "quranReference": "Quran (22:69)",
      "description": "The name Al Hakam describes Allah's quality of being the most wise and best of judges. Since He is the best judge, we should not be worried what He has decreed. We should also strive to be impartial, which is a trait that Allah embodies. We can only change ourselves and our own actions, so we should not focus on external factors and judge others based on their outwardly appearances and actions."
    },
    {
      "number": 29,
      "name": "Al 'Adl",
      "meaning": "The Utterly Just",
      "appearances": "Not directly in the Quran, but is described",
      "arabicText": "وَتَمَّتْ كَلِمَتُ رَبِّكَ صِدْقًۭا وَعَدْلًۭا ۚ لَّا مُبَدِّلَ لِكَلِمَـٰتِهِۦ ۚ وَهُوَٱلسَّمِيعُ ٱلْعَلِيمُ",
      "translation": "Allah will judge between you on the Day of Resurrection concerning that over which you used to differ.",
      "quranReference": "Quran (22:69)",
      "description": "The name Al 'Adl imparts Allah's characteristic of being the most just and the one who maintains balance, justice, and equality. While some may view their sufferings as injustice, this is an incorrect mentality as Allah is always fair. We will never face tragedy without reason, and since Allah is the most knowledgeable, He is either testing us for our own benefit, or we will receive rewards for our suffering in the Hereafter. As Allah mentioned in the Quran, \"with every hardship is ease,\" whether that comes in this world or the hereafter."
    },
    {
      "number": 30,
      "name": "Al Lateef",
      "meaning": "The Subtle One",
      "appearances": "Not directly in the Quran, but is described",
      "arabicText": "يَـٰبُنَىَّ إِنَّهَآ إِن تَكُ مِثْقَالَ حَبَّةٍۢ مِّنْ خَرْدَلٍۢ فَتَكُن فِى صَخْرَةٍأَوْ فِى ٱلسَّمَـٰوَٰتِ أَوْ فِى ٱلْأَرْضِ يَأْتِ بِهَا ٱللَّهُ ۚ إِنَّ ٱللَّهَ لَطِيفٌخَبِيرٌۭ",
      "translation": "Allah will judge between you on the Day of Resurrection concerning that over which you used to differ.",
      "quranReference": "Quran (22:69)",
      "description": "The name Al Lateef shows that Allah is the most gentle and graceful. He knows exactly what we need at exactly the right time and the subtle details of our circumstances. He pays attention to the nuances and doesn't overlook even the minor aspects of His creations."
    },
    {
      "number": 31,
      "name": "Al Khabeer",
      "meaning": "The All-Acquainted",
      "appearances": "45 times in the Quran",
      "arabicText": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱتَّقُواْ ٱللَّهَ وَلۡتَنظُرۡ نَفۡسٞ مَّا قَدَّمَتۡ لِغَدٖۖوَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ خَبِيرُۢ بِمَا تَعۡمَلُونَ",
      "translation": "O you who have believed, fear Allah. And let every soul look to what it has put forth for tomorrow – and fear Allah. Indeed, Allah is Acquainted with what you do.",
      "quranReference": "Quran (59:18)",
      "description": "The name Al Khabeer shows that Allah has knowledge and experience of everything. So not only is He aware of the subtlest of details, but He is well acquainted with them as well. However His awareness is not only as a result of observance, but is His intrinsic nature. He has expert knowledge of all of His creations since He was the one who created them in the first place."
    },
    {
      "number": 32,
      "name": "Al Haleem",
      "meaning": "The Most Forbearing",
      "appearances": "11 times in the Quran",
      "arabicText": "إِنَّ ٱلَّذِينَ تَوَلَّوۡاْ مِنكُمۡ يَوۡمَ ٱلۡتَقَى ٱلۡجَمۡعَانِ إِنَّمَا ٱسۡتَزَلَّهُمُٱلشَّيۡطَٰنُ بِبَعۡضِ مَا كَسَبُواْۖ وَلَقَدۡ عَفَا ٱللَّهُ عَنۡهُمۡۗ إِنَّ ٱللَّهَغَفُورٌ حَلِيمٞ",
      "translation": "Indeed, those of you who turned back on the day the two armies met, it was Satan who caused them to slip because of some [blame] they had earned. But Allah has already forgiven them. Indeed, Allah is Forgiving and Forbearing.",
      "quranReference": "Quran (3:155)",
      "description": "The name Al Haleem describes Allah's quality of being forgiving, gentle, and gradual. He is not hasty in administering punishment and continues to give us second chances even when we are disobedient and undeserving of them. From this name, we can learn to be more forgiving and tolerant of others instead of resorting to vengeance."
    },
    {
      "number": 33,
      "name": "Al 'Azeem",
      "meaning": "The Magnificent One",
      "appearances": "9 times in the Quran",
      "arabicText": "لَهُۥ مَا فِى ٱلسَّمَـٰوَٰتِ وَمَا فِى ٱلْأَرْضِ ۖ وَهُوَ ٱلْعَلِىُّ ٱلْعَظِيمُ",
      "translation": "To Him belongs whatever is in the heavens and whatever is in the earth, and He is the Most High, the Most Great.",
      "quranReference": "Quran (42:4)",
      "description": "The name Al 'Azeem describes Allah's quality of being the greatest in every aspect. He has no limitations to His capabilities, mercy, knowledge, or forgiveness. We should use this name when supplicating to Allah to remind us that no obstacle is ever too large for Allah and no dream is ever too lofty for Allah to grant. We should also feel a sense of humility since our notions of status or superiority are insignificant compared to Allah's greatness."
    },
    {
      "number": 34,
      "name": "Al Ghafoor",
      "meaning": "The Most Forgiving",
      "appearances": "91 times in the Quran",
      "arabicText": "نَبِّئْ عِبَادِىٓ أَنِّىٓ أَنَا ٱلْغَفُورُ ٱلرَّحِيمُ",
      "translation": "[O Muhammad], inform My servants that it is I who am the Forgiving, the Merciful.",
      "quranReference": "Quran (15:49)",
      "description": "The name Al Ghafoor describes the vast nature of Allah's forgiveness. In the face of Allah's forgiveness, it doesn't matter how severe the sin or circumstance may be. Not only does He forgive our sins, but He also conceals them from being exposed.",
      "additionalInfo": "Abu Huraira reported Allah's Apostle (ﷺ) as saying: The servant (who conceals) the faults of others in this world, Allah would conceal his faults on the Day of Resurrection. -Sahih Muslim 2590a"
    },
    {
      "number": 35,
      "name": "Ash Shakoor",
      "meaning": "The Most Appreciative",
      "appearances": "4 times in the Quran",
      "arabicText": "مَّا يَفْعَلُ ٱللَّهُ بِعَذَابِكُمْ إِن شَكَرْتُمْ وَءَامَنتُمْ ۚ وَكَانَ ٱللَّهُشَاكِرًا عَلِيمًۭا",
      "translation": "What can Allah gain by your punishment, if you are grateful and you believe? No, it is Allah that recognizes (all good), and knows all things.",
      "quranReference": "Quran (15:49)",
      "description": "The name Ash Shakoor shows that Allah is recognizes and is appreciative of our worship of Him, no matter how small the action is. Allah rewards our every good deed done with the intention of pleasing Him, and even multiplies the rewards for us. Humans like to feel that their efforts are acknowledged, but we should only perform good deeds with the intention of getting rewards from Allah as there is no greater recognition than Allah's. Since Allah is grateful to His servants when He doesn't need to be, we should express gratitude towards Him for this. We need Allah, but Allah does not need us."
    },
    {
      "number": 36,
      "name": "Al 'Aliyy",
      "meaning": "The Most High",
      "appearances": "5 times in the Quran",
      "arabicText": "وَلَا تَنفَعُ ٱلشَّفَٰعَةُ عِندَهُۥٓ إِلَّا لِمَنۡ أَذِنَ لَهُۥۚ حَتَّىٰٓ إِذَا فُزِّعَ عَنقُلُوبِهِمۡ قَالُواْ مَاذَا قَالَ رَبُّكُمۡۖ قَالُواْ ٱلۡحَقَّۖ وَهُوَ ٱلۡعَلِيُّ ٱلۡكَبِيرُى",
      "translation": "And intercession does not benefit with Him except for one whom He permits. [And those wait] until, when terror is removed from their hearts, they will say [to one another], \"What has your Lord said?\" They will say, \"The truth.\" And He is the Most High, the Grand.",
      "quranReference": "Quran (34:23)",
      "description": "The name Al 'Aliyy describes Allah's quality of being the highest in rank. Everything is insignificant compared to His grandeur. In addition to this, He is also literally above us and watching over us. This is something we should keep in mind when acting."
    },
    {
      "number": 37,
      "name": "Al Kabeer",
      "meaning": "The Most Great",
      "appearances": "6 times in the Quran",
      "arabicText": "ذَٰلِكَ بِأَنَّ ٱللَّهَ هُوَ ٱلْحَقُّ وَأَنَّ مَا يَدْعُونَ مِن دُونِهِ ٱلْبَـٰطِلُوَأَنَّ ٱللَّهَ هُوَ ٱلْعَلِىُّ ٱلْكَبِيرُ",
      "translation": "That is because Allah is the Truth, and that which they call upon other than Him is falsehood, and because Allah is the Most High, the Grand.",
      "quranReference": "Quran (22:62)",
      "description": "The name Al Kabeer, similar to the name Al 'Azeem, describes Allah's quality of being the greatest, not just physically but in terms of strength and every other aspect. This name reminds us to remain humble since Allah is so drastically superior to us."
    },
    {
      "number": 38,
      "name": "Al Hafeez",
      "meaning": "The Preserver",
      "appearances": "6 times in the Quran",
      "arabicText": "إِنَّا نَحْنُ نَزَّلْنَا ٱلذِّكْرَ وَإِنَّا لَهُۥ لَحَـٰفِظُونَ",
      "translation": "Indeed, it is We who sent down the Qur'an and indeed, We will be its guardian.",
      "quranReference": "Quran (15:9)",
      "description": "The name Al Hafeez shows that Allah is the protector of His creations and established a perfect balance for everything. He has instilled a sense of self-preservation in all creation and ensures that each species' life cycle is perfectly attuned to their needs. We should aspire to exhibit this trait and be the preservers, or hafiz, of the Quran, even if it's only several surahs. We should also try to preserve our deen and our character from the influence of Shaitan. We should try to preserve our relationships and refrain from corrupting them with backbiting, gossiping, and envy."
    },
    {
      "number": 39,
      "name": "Al Muqeet",
      "meaning": "The Nourisher",
      "appearances": "1 time in the Quran",
      "arabicText": "مَّن يَشۡفَعۡ شَفَٰعَةً حَسَنَةٗ يَكُن لَّهُۥ نَصِيبٞ مِّنۡهَاۖ وَمَن يَشۡفَعۡشَفَٰعَةٗ سَيِّئَةٗ يَكُن لَّهُۥ كِفۡلٞ مِّنۡهَاۗ وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖمُّقِيتٗا",
      "translation": "Whoever intercedes for a good cause will have a reward therefrom; and whoever intercedes for an evil cause will have a burden therefrom. And ever is Allah, over all things, a Keeper.",
      "quranReference": "Quran (4:85)",
      "description": "The name Al Muqeet shows that Allah provides us with not only physical nourishment, but also our spiritual needs. We try to satisfy our souls with material comforts, but we should turn to Allah and increase our spiritual aspirations. In the physical sense, too, we should not resort to unlawful means to attain worldly provisions, since Allah has already written what provisions we will receive and we will get them no matter what. This name is similar to the name Ar Razzaq, but with more of a focus on spiritual rizq."
    },
    {
      "number": 40,
      "name": "Al Haseeb",
      "meaning": "The Reckoner",
      "appearances": "3 times in the Quran",
      "arabicText": "ٱلَّذِينَ يُبَلِّغُونَ رِسَـٰلَـٰتِ ٱللَّهِ وَيَخْشَوْنَهُۥ وَلَا يَخْشَوْنَ أَحَدًاإِلَّا ٱللَّهَ ۗ وَكَفَىٰ بِٱللَّهِ حَسِيبًۭا",
      "translation": "[Allah praises] those who convey the messages of Allah and fear Him and do not fear anyone but Allah. And sufficient is Allah as Accountant.",
      "quranReference": "Quran (33:39)",
      "description": "The name Al Haseeb describes Allah's quality of being the one who calculates and accounts for each person's deeds without any inaccuracy. He is also self-sufficient and is not reliant on anything, unlike any other creature. This name should remind us that we shouldn't waste the time we have been given on this Earth and should take any chance we have to engage in good actions."
    },
    {
      "number": 41,
      "name": "Al Jaleel",
      "meaning": "The Majestic",
      "appearances": "Does not directly appear in the Quran but is described",
      "arabicText": "وَيَبْقَىٰ وَجْهُ رَبِّكَ ذُو ٱلْجَلَـٰلِ وَٱلْإِكْرَامِ",
      "translation": "And there will remain the Face of your Lord, Owner of Majesty and Honor.",
      "quranReference": "Quran (55:27)",
      "description": "The name Al Jaleel shows that Allah is completely unique and does not resemble anything else in the past, present, or future. This name, in addition to Al Kabeer (The Great) and Al Azeem (The Magnificent One), make up the names of Jalal or majesty. Taking a lesson from Allah's majesty, we should try to perfect our inner selves and character instead of just our outer beauty."
    },
    {
      "number": 42,
      "name": "Al Kareem",
      "meaning": "The Most Generous",
      "appearances": "3 times in the Quran",
      "arabicText": "إِنَّ ٱلۡمُصَّدِّقِينَ وَٱلۡمُصَّدِّقَٰتِ وَأَقۡرَضُواْ ٱللَّهَ قَرۡضًا حَسَنٗايُضَٰعَفُ لَهُمۡ وَلَهُمۡ أَجۡرٞ كَرِيمٞ",
      "translation": "Indeed, the men who practice charity and the women who practice charity and [they who] have loaned Allah a goodly loan – it will be multiplied for them, and they will have a noble reward.",
      "quranReference": "Quran (57:18)",
      "description": "The name Al Kareem embodies Allah's generosity and ability to bestow honor, but also shows that Allah is the most honorable and noble Himself. According to the last name, Al Jaleel (The Majestic), Allah is the highest in rank, therefore He must be the most honorable. This name also shows Allah's great generosity and mercy. An example of this is that the reward for any good action is far greater than the magnitude of the action itself. From this name, we can learn to give more freely and not grudgingly, in order to become more noble in character."
    },
    {
      "number": 43,
      "name": "Ar Raqeeb",
      "meaning": "The Observer",
      "appearances": "3 times in the Quran",
      "arabicText": "يَـٰٓأَيُّهَا ٱلنَّاسُ ٱتَّقُواْ رَبَّكُمُ ٱلَّذِي خَلَقَكُم مِّن نَّفۡسٖ وَٰحِدَةٖوَخَلَقَ مِنۡهَا زَوۡجَهَا وَبَثَّ مِنۡهُمَا رِجَالٗا كَثِيرٗا وَنِسَآءٗۚ وَٱتَّقُواْٱللَّهَ ٱلَّذِي تَسَآءَلُونَ بِهِۦ وَٱلۡأَرۡحَامَۚ إِنَّ ٱللَّهَ كَانَ عَلَيۡكُمۡرَقِيبٗا",
      "translation": "[Allah praises] those who convey the messages of Allah and fear Him and do not fear anyone but Allah. And sufficient is Allah as Accountant.",
      "quranReference": "Quran (33:39)",
      "description": "The name Ar Raqeeb describes Allah's quality of being watchful over us. This is not meant in a scrutinizing way, but rather as a parent or guardian would over their child. It is intended in a loving and protective manner, but also serves as a reminder that we should be cautious of committing wrong actions since Allah is watching our deeds."
    },
    {
      "number": 44,
      "name": "Al Mujeeb",
      "meaning": "The Responsive",
      "appearances": "once in the Quran",
      "arabicText": "۞وَإِلَىٰ ثَمُودَ أَخَاهُمۡ صَٰلِحٗاۚ قَالَ يَٰقَوۡمِ ٱعۡبُدُواْ ٱللَّهَ مَا لَكُممِّنۡ إِلَٰهٍ غَيۡرُهُۥۖ هُوَ أَنشَأَكُم مِّنَ ٱلۡأَرۡضِ وَٱسۡتَعۡمَرَكُمۡ فِيهَافَٱسۡتَغۡفِرُوهُ ثُمَّ تُوبُوٓاْ إِلَيۡهِۚ إِنَّ رَبِّي قَرِيبٞ مُّجِيبٞ",
      "translation": "[Allah praises] those who convey the messages of Allah and fear Him and do not fear anyone but Allah. And sufficient is Allah as Accountant.",
      "quranReference": "Quran (33:39)",
      "description": "The name Al Mujeeb describes Allah's quality of being the closest to us and the most responsive. From this name, we can learn that we should strive to also be responsive towards Allah and to fulfill our commitments towards Him.",
      "additionalInfo": "According to a Hadith, narrated by Anas: \"The Prophet ﷺ said, \"My Lord says, 'If My slave comes nearer to me for a span, I go nearer to him for a cubit; and if he comes nearer to Me for a cubit, I go nearer to him for the span of outstretched arms; and if he comes to Me walking, I go to him running.'\" - Sahih Al-Bukhari 7536"
    },
    {
      "number": 45,
      "name": "Al Waasi'",
      "meaning": "The Boundless",
      "appearances": "9 times in the Quran",
      "arabicText": "وَلِلَّهِ ٱلۡمَشۡرِقُ وَٱلۡمَغۡرِبُۚ فَأَيۡنَمَا تُوَلُّواْ فَثَمَّ وَجۡهُ ٱللَّهِۚ إِنَّ ٱللَّهَوَٰسِعٌ عَلِيمٞ",
      "translation": "And to Allah belongs the east and the west. So wherever you [might] turn, there is the Face of Allah. Indeed, Allah is all-Encompassing and Knowing.",
      "quranReference": "Quran (2:115)",
      "description": "The name Al Waasi' refers to Allah's vastness and quality of being all-encompassing. The entire universe is His domain and He is with us wherever we are. His mercy and provision are both vast, so we should never worry that we won't be forgiven or provided for."
    },
    {
      "number": 46,
      "name": "Al Hakeem",
      "meaning": "The All-Wise",
      "appearances": "93 times in the Quran",
      "arabicText": "وَيُبَيِّنُ ٱللَّهُ لَكُمُ ٱلۡأٓيَٰتِۚ وَٱللَّهُ عَلِيمٌ حَكِيمٌ",
      "translation": "And Allah makes clear to you the verses, and Allah is Knowing and Wise.",
      "quranReference": "Quran (24:18)",
      "description": "The name Al Hakeem shows Allah's wisdom in all matters. His wisdom is evident in all of His creation, and is present in the way that every minuscule thing has its purpose. We can learn from this name that every incident in our lives serves a purpose and no matter how much we may wish for things to go differently, Allah has a purpose for each occurrence out of His infinite wisdom. We don't have the foresight to understand the reason why something happens to us that we may see as a misfortune, when in fact it will lead to something better."
    },
    {
      "number": 47,
      "name": "Al Wadood",
      "meaning": "The Most Loving",
      "appearances": "2 times in the Quran",
      "arabicText": "وَٱسۡتَغۡفِرُواْ رَبَّكُمۡ ثُمَّ تُوبُوٓاْ إِلَيۡهِۚ إِنَّ رَبِّي رَحِيمٞ وَدُودٞ",
      "translation": "And ask forgiveness of your Lord and then repent to Him. Indeed, my Lord is Merciful and Affectionate.",
      "quranReference": "Quran (11:90)",
      "description": "The name Al Wadood emphasizes Allah's love and care towards His creations. There isn't a single creature that is incapable of receiving His forgiveness or love. This name should inspire hope in believers and encourage us to do more actions that are beloved to Allah."
    },
    {
      "number": 48,
      "name": "Al Majeed",
      "meaning": "The Glorious",
      "appearances": "once in the Quran",
      "arabicText": "قَالُوٓاْ أَتَعۡجَبِينَ مِنۡ أَمۡرِ ٱللَّهِۖ رَحۡمَتُ ٱللَّهِ وَبَرَكَٰتُهُۥ عَلَيۡكُمۡأَهۡلَ ٱلۡبَيۡتِۚ إِنَّهُۥ حَمِيدٞ مَّجِيدٞ",
      "translation": "They said, 'Are you amazed at the decree of Allah? May the mercy of Allah and His blessings be upon you, people of the house. Indeed, He is Praiseworthy and Honorable.'",
      "quranReference": "Quran (11:73)",
      "description": "The name Al Majeed indicates Allah's glory and perfection. All of His attributes are perfect within themselves. In the Quran, both itself and the throne of Allah are also described as being \"majeed\" or glorious, meaning that Allah's words and status are all befitting of His glory. We should also strive to perfect our character in order to raise our rank and become closer to Allah."
    },
    {
      "number": 49,
      "name": "Al Baa'ith",
      "meaning": "The Resurrector",
      "appearances": "Not mentioned in the Quran but is described",
      "arabicText": "وَهُوَ ٱلَّذِي يَتَوَفَّىٰكُم بِٱلَّيۡلِ وَيَعۡلَمُ مَا جَرَحۡتُم بِٱلنَّهَارِ ثُمَّيَبۡعَثُكُمۡ فِيهِ لِيُقۡضَىٰٓ أَجَلٞ مُّسَمّٗىۖ ثُمَّ إِلَيۡهِ مَرۡجِعُكُمۡ ثُمَّيُنَبِّئُكُم بِمَا كُنتُمۡ تَعۡمَلُونَ",
      "translation": "And it is He who takes your souls by night and knows what you have committed by day. Then He revives you therein that a specified term may be fulfilled. Then to Him will be your return; then He will inform you about what you used to do.",
      "quranReference": "Quran (6:60)",
      "description": "The name Al Baa'ith illustrates Allah's power to bring life back into the dead. He is the only one who can grant life and bring death. From this name, we should reflect on the fact that we must make use of the time we have been given before we die. The next time we will be alive will be on the Day of Judgement, when it will already be too late to change our outcomes."
    },
    {
      "number": 50,
      "name": "Ash Shaheed",
      "meaning": "The All Observing Witness",
      "appearances": "18 times in the Quran",
      "arabicText": "يَوۡمَ يَبۡعَثُهُمُ ٱللَّهُ جَمِيعٗا فَيُنَبِّئُهُم بِمَا عَمِلُوٓاْۚ أَحۡصَىٰهُ ٱللَّهُوَنَسُوهُۚ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ شَهِيدٌ",
      "translation": "On the Day when Allah will resurrect them all and inform them of what they did. Allah had enumerated it, while they forgot it; and Allah is, over all things, Witness.",
      "quranReference": "Quran (58:6)",
      "description": "The name Ash Shaheed emphasizes that Allah is a witness over all of us and watches everything that we do. He is also the witness of the unseen that humans cannot see. On the Day of Judgement, He will be the witness to all of history. We should be satisfied with Allah as our witness, since we know He accounts for every good deed we have done. It doesn't matter if people don't appreciate us for our actions, Allah knows every word and action that occurs. On the flip side, we must also be conscious of the fact that when we are tempted to do bad, Allah is also watching us."
    },
    {
      "number": 51,
      "name": "Al Haqq",
      "meaning": "The Absolute Truth",
      "appearances": "10 times in the Quran",
      "arabicText": "ذَٰلِكَ بِأَنَّ ٱللَّهَ هُوَ ٱلۡحَقُّ وَأَنَّ مَا يَدۡعُونَ مِن دُونِهِ ٱلۡبَٰطِلُوَأَنَّ ٱللَّهَ هُوَ ٱلۡعَلِيُّ ٱلۡكَبِيرُ",
      "translation": "That is because Allah is the Truth, and that what they call upon other than Him is falsehood, and because Allah is the Most High, the Grand.",
      "quranReference": "Quran (31:30)",
      "description": "The name Al Haqq describes Allah's quality of being the embodiment of truth. This means that every aspect of Him is the truth. His word is true, His promises are true, and our meeting with Him on the Day of Judgement is true. In fact, we see that the Quran mentions many scientific truths that were not even discovered until modern times. Since we know that Allah is truthful, this means that we must place our trust in His judgement. No matter how we may feel about His decree, we can trust that it must be beneficial to us in some way."
    },
    {
      "number": 52,
      "name": "Al Wakeel",
      "meaning": "The Trustee",
      "appearances": "14 times in the Quran",
      "arabicText": "وَلِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۚ وَكَفَىٰ بِٱللَّهِ وَكِيلًا",
      "translation": "And to Allah belongs whatever is in the heavens and whatever is on the earth. And sufficient is Allah as Disposer of affairs.",
      "quranReference": "Quran (4:132)",
      "description": "The name Al Wakeel signifies that Allah is the most trustworthy and is the only one to whom we should entrust all of our affairs. It is important to find someone to entrust with your affairs that is trustworthy, knowledgeable, and powerful, and Allah possesses the best of all of these qualities. He will always be around even after we die, so we can trust Him to take care of us for our entire lives, unlike any other worldly trustees. Allah takes care of His servants when they turn to Him in need and is the one who provides for us. Although we must act in order to receive provision, Allah is the one who controls the final outcome."
    },
    {
      "number": 53,
      "name": "Al Qawiyy",
      "meaning": "The Most Strong",
      "appearances": "9 times in the Quran",
      "arabicText": "مَا قَدَرُواْ ٱللَّهَ حَقَّ قَدۡرِهِۦٓۚ إِنَّ ٱللَّهَ لَقَوِيٌّ عَزِيزٌا",
      "translation": "They have not appraised Allah with true appraisal. Indeed, Allah is Powerful and Exalted in Might.",
      "quranReference": "Quran (22:74)",
      "description": "The name Al Qawiyy shows that Allah is strong in all aspects, so we should rely on Him for our success. When given a choice between two leaders, one would undoubtedly choose one with greater strength and trustworthiness. Allah is far superior than any worldly leaders in every aspect since He has unlimited capability."
    },
    {
      "number": 54,
      "name": "Al Mateen",
      "meaning": "The Firm One",
      "appearances": "one time in the Quran",
      "arabicText": "إِنَّ ٱللَّهَ هُوَ ٱلرَّزَّاقُ ذُو ٱلۡقُوَّةِ ٱلۡمَتِينُ",
      "translation": "Indeed, it is Allah who is the [continual] Provider, the firm possessor of strength.",
      "quranReference": "Quran (51:58)",
      "description": "The name Al Mateen, similar to the name Al Qawiyy, describes Allah's strength and firmness. These two names are often paired together, due to their similar meanings. Allah's strength is firm and nothing can shake His will or cause any difficulty to Him. This name emphasizes that Allah's power can't be resisted or countered. If Allah wills something to happen, no one in the universe can stop it from happening and vice versa."
    },
    {
      "number": 55,
      "name": "Al Waliyy",
      "meaning": "The Protecting Associate",
      "appearances": "15 times in the Quran",
      "arabicText": "إِنَّمَا وَلِيُّكُمُ ٱللَّهُ وَرَسُولُهُۥ وَٱلَّذِينَ ءَامَنُواْ ٱلَّذِينَ يُقِيمُونَٱلصَّلَوٰةَ وَيُؤۡتُونَ ٱلزَّكَوٰةَ وَهُمۡ رَٰكِعُونَ",
      "translation": "Your ally is none but Allah and [therefore] His Messenger and those who have believed – those who establish prayer and give zakah, and they bow [in worship].",
      "quranReference": "Quran (5:55)",
      "description": "The name Al Waliyy shows that Allah is the close friend and ally of every true believer and will protect, support, and look after them. This position is like if one were to be in the inner circle of a king or extremely successful person, which might be a special position signifying great success. However, being able to be one of the awliyah (friends) of Allah is the greatest success one can achieve.",
      "additionalInfo": "According to Abu Hurayrah (may Allah be pleased with him): The Messenger of Allah ﷺ said, \"Verily Allah ta'ala has said: 'Whosoever shows enmity to a wali (friend) of Mine, then I have declared war against him. And My servant does not draw near to Me with anything more loved to Me than the religious duties I have obligated upon him. And My servant continues to draw near to me with nafil (supererogatory) deeds until I Love him. When I Love him, I am his hearing with which he hears, and his sight with which he sees, and his hand with which he strikes, and his foot with which he walks. Were he to ask [something] of Me, I would surely give it to him; and were he to seek refuge with Me, I would surely grant him refuge.'\" -Sahih al-Bukhari 6502"
    },
    {
      "number": 56,
      "name": "Al Hameed",
      "meaning": "The Praiseworthy",
      "appearances": "17 times in the Quran",
      "arabicText": "۞يَـٰٓأَيُّهَا ٱلنَّاسُ أَنتُمُ ٱلۡفُقَرَآءُ إِلَى ٱللَّهِۖ وَٱللَّهُ هُوَ ٱلۡغَنِيُّ ٱلۡحَمِيدُ",
      "translation": "O mankind, you are those in need of Allah, while Allah is the Free of need, the Praiseworthy.",
      "quranReference": "Quran (35:15)",
      "description": "The name Al Hameed illustrates that Allah is the only one worthy of all praise. No matter what condition we are in, we should say Alhamdulillah since regardless of how dire our situation may be, Allah still has provided us with so much. Often when someone creates something impressive, we praise them and view them with great respect. Allah is the creator of all existence, so He must be the most praiseworthy of all."
    },
    {
      "number": 57,
      "name": "Al Muhsee",
      "meaning": "The Counter",
      "appearances": "Does not directly appear in the Quran but is described",
      "arabicText": "لِّيَعۡلَمَ أَن قَدۡ أَبۡلَغُواْ رِسَٰلَٰتِ رَبِّهِمۡ وَأَحَاطَ بِمَا لَدَيۡهِمۡ وَأَحۡصَىٰكُلَّ شَيۡءٍ عَدَدَۢا",
      "translation": "That he may know that they have conveyed the messages of their Lord; and He has encompassed whatever is with them and has enumerated all things in number.",
      "quranReference": "Quran (72:28)",
      "description": "The name Al Muhsee describes Allah's attribute of accounting for every one of His creations. He is able to calculate the infinite possibilities behind each choice and their effects. Unlike us and our limited memory, Allah knows each of His creations throughout history by name and remembers each one's personality, deeds, thoughts, and supplications."
    },
    {
      "number": 58,
      "name": "Al Mubdee",
      "meaning": "The Originator",
      "appearances": "Does not directly appear in the Quran but is described",
      "arabicText": "أَمَّن يَبۡدَؤُاْ ٱلۡخَلۡقَ ثُمَّ يُعِيدُهُۥ وَمَن يَرۡزُقُكُم مِّنَ ٱلسَّمَآءِوَٱلۡأَرۡضِۗ أَءِلَٰهٞ مَّعَ ٱللَّهِۚ قُلۡ هَاتُواْ بُرۡهَٰنَكُمۡ إِن كُنتُمۡ صَٰدِقِينَ",
      "translation": "Is He [not best] who begins creation and then repeats it and who provides for you from the heaven and earth? Is there a deity with Allah? Say, 'Produce your proof, if you should be truthful.'",
      "quranReference": "Quran (27:64)",
      "description": "The name Al Mubdee shows that Allah's creation is completely original and has no precedent, always derived from nothingness. This is completely unlike us, as we cannot create from scratch and always use inspiration or materials from what Allah has created around us. This name should make us reflect on the numerous blessings that Allah has provided us with, from the complexities of our own bodies to the natural resources surrounding us."
    },
    {
      "number": 59,
      "name": "Al Mu'eed",
      "meaning": "The Restorer",
      "appearances": "Does not directly appear in the Quran but is described",
      "arabicText": "قُلۡ هَلۡ مِن شُرَكَآئِكُم مَّن يَبۡدَؤُاْ ٱلۡخَلۡقَ ثُمَّ يُعِيدُهُۥۚ قُلِ ٱللَّهُيَبۡدَؤُاْ ٱلۡخَلۡقَ ثُمَّ يُعِيدُهُۥۖ فَأَنَّىٰ تُؤۡفَكُونَ",
      "translation": "Say, \"Are there of your 'partners' any who begins creation and then repeats it?\" Say, 'Allah begins creation and then repeats it, so how are you deluded?'",
      "quranReference": "Quran (10:34)",
      "description": "The name Al Mu'eed is the counterpart to the previous name, and reminds us that we will be returned back to Allah. This name establishes Allah's ability to restore everything to its original state, just as He originates them. Just as Allah brought us to life in the Dunya, He will make us die and take us back to Him."
    },
    {
      "number": 60,
      "name": "Al Muhyee",
      "meaning": "The Giver of Life",
      "appearances": "Does not directly appear in the Quran but is described",
      "arabicText": "كَيۡفَ تَكۡفُرُونَ بِٱللَّهِ وَكُنتُمۡ أَمۡوَٰتٗا فَأَحۡيَٰكُمۡۖ ثُمَّ يُمِيتُكُمۡثُمَّ يُحۡيِيكُمۡ ثُمَّ إِلَيۡهِ تُرۡجَعُونَ",
      "translation": "How can you disbelieve in Allah when you were lifeless and He brought you to life; then He will cause you to die, then He will bring you [back] to life, and then to Him you will be returned.",
      "quranReference": "Quran (2:28)",
      "description": "The name Al Muhyee not only describes Allah's ability to grant life, but also establishes that Allah is the source of life. He is everlasting and will not ever die, deteriorate, or have the need to depend on anything else to sustain Himself. He is the one who gave us the gift of life and created us with purpose, so we should remember to be grateful to Him."
    },
    {
      "number": 61,
      "name": "Al Mumeet",
      "meaning": "The Bringer of Death",
      "appearances": "Does not directly appear in the Quran but is described",
      "arabicText": "لَهُۥ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ يُحۡيِۦ وَيُمِيتُۖ وَهُوَ عَلَىٰ كُلِّ شَيۡءٖقَدِيرٌ",
      "translation": "His is the dominion of the heavens and earth. He gives life and causes death, and He is over all things competent.",
      "quranReference": "Quran (57:2)",
      "description": "The name Al Mumeet is the pair to the previous name, Al Muhyee, and it describes Allah's attribute of being the only one who can bring death. These two names establish a balance between two necessary aspects of our existence: life and death, both things that only Allah can grant. This name is a reminder of the fleeting nature of our existence. We should make use of the time we have since we don't know when our deaths will occur.",
      "additionalInfo": "A dua with this name: اَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيتُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ (\"None has the right to be worshipped but Allah alone, Who has no partner. His is the dominion and His is the praise. He brings life and He causes death, and He is Able to do all things.\") -Sahih (Darussalam) Jami at-Tirmidhi 3553"
    },
    {
      "number": 62,
      "name": "Al Hayy",
      "meaning": "The Ever Living",
      "appearances": "5 times in the Quran",
      "arabicText": "هُوَ ٱلْحَىُّ لَآ إِلَـٰهَ إِلَّا هُوَ فَٱدْعُوهُ مُخْلِصِينَ لَهُ ٱلدِّينَ ۗ ٱلْحَمْدُلِلَّهِ رَبِّ ٱلْعَـٰلَمِينَ",
      "translation": "He is the Ever-Living; there is no deity except Him, so call upon Him, [being] sincere to Him in religion. [All] praise is [due] to Allah, Lord of the worlds.",
      "quranReference": "Quran (40:65)",
      "description": "The name Al Hayy indicates that Allah is everlasting and will continue to exist forever without any beginning or end, just as mentioned with the name Al Muhyee (The Giver of Life). His state of living is also perfect, meaning He is incapable of becoming tired, sick, or otherwise impaired. Unlike us, Allah does not need to operate within specific limitations and is unlimitedly capable."
    },
    {
      "number": 63,
      "name": "Al Qayyoom",
      "meaning": "The Self-Subsisting",
      "appearances": "3 times in the Quran",
      "arabicText": "وَعَنَتِ ٱلْوُجُوهُ لِلْحَىِّ ٱلْقَيُّومِ ۖ وَقَدْ خَابَ مَنْ حَمَلَ ظُلْمًۭا",
      "translation": "And [all] faces will be humbled before the Ever-Living, the Sustainer of existence. And he will have failed who carries injustice.",
      "quranReference": "Quran (20:111)",
      "description": "The name Al Qayyoom describes Allah's quality of being self-sustaining. It is always mentioned in the Quran paired with the previous name, Al Hayy. In contrast to all creatures, who are dependent on Allah and each other to survive, Allah is truly independent and does not need anyone else. Not only is He himself self-subsisting, but He also sustains all of His creations and ensures their wellbeing."
    },
    {
      "number": 64,
      "name": "Al Waajid",
      "meaning": "The Perceiver",
      "appearances": "Does not directly appear in the Quran but is described",
      "arabicText": "وَٱلَّذِينَ كَفَرُوٓاْ أَعۡمَٰلُهُمۡ كَسَرَابِۭ بِقِيعَةٖ يَحۡسَبُهُ ٱلظَّمۡـَٔانُ مَآءً حَتَّىٰٓ إِذَا جَآءَهُۥ لَمۡ يَجِدۡهُ شَيۡـٔٗا وَوَجَدَ ٱللَّهَ عِندَهُۥ فَوَفَّىٰهُ حِسَابَهُۥۗ وَٱللَّهُ سَرِيعُ ٱلۡحِسَابِ",
      "translation": "But those who disbelieved – their deeds are like a mirage in a lowland which a thirsty one thinks is water until, when he comes to it, he finds it is nothing but finds Allah before Him, and He will pay him in full his due; and Allah is swift in account.",
      "quranReference": "Quran (24:39)",
      "description": "The name Al Waajid describes Allah's attribute of being the finder. In other words, it indicates Allah's resourcefulness and perception towards all of His creations. If there is anything Allah wants to find or see, there is nothing that can stop Him from doing so. He is able to know the truth of everything no matter how much anyone tries to hide it."
    },
    {
      "number": 65,
      "name": "Al Maajid",
      "meaning": "The Illustrious",
      "appearances": "Does not directly appear in the Quran but is described",
      "arabicText": "قَالُوٓاْ أَتَعۡجَبِينَ مِنۡ أَمۡرِ ٱللَّهِۖ رَحۡمَتُ ٱللَّهِ وَبَرَكَٰتُهُۥ عَلَيۡكُمۡ أَهۡلَ ٱلۡبَيۡتِۚ إِنَّهُۥ حَمِيدٞ مَّجِيدٞ",
      "translation": "They said, 'Are you amazed at the decree of Allah? May the mercy of Allah and His blessings be upon you, people of the house. Indeed, He is Praiseworthy and Honorable.'",
      "quranReference": "Quran (11:73)",
      "description": "The name Al Maajid, like its different form, Al Majeed, has a connotation of nobility, glory, and generosity. However, this word form indicates a more extreme form of Al Majeed, such that it describes a quality that only Allah can possess. We can see from this name, once again, that Allah is the only one worthy of praise. The concept of being glorious or magnificent also means that Allah is perfect in every way."
    },
    {
      "number": 66,
      "name": "Al Waahid",
      "meaning": "The One",
      "appearances": "5 times in the Quran",
      "arabicText": "قُلۡ إِنَّمَآ أَنَا۠ مُنذِرٞۖ وَمَا مِنۡ إِلَٰهٍ إِلَّا ٱللَّهُ ٱلۡوَٰحِدُ ٱلۡقَهَّارُ",
      "translation": "Say, [O Muhammad], \"I am only a warner, and there is not any deity except Allah, the One, the Prevailing.\"",
      "quranReference": "Quran (38:65)",
      "description": "The name Al Waahid indicates that Allah is the only one who is worthy of being worshipped. He is unique in all ways and there is no one who can compare to Him. This name also shows that Allah is indivisible and cannot be divided or duplicated, such that He would be dependent on anything else."
    },
    {
      "number": 67,
      "name": "Al Ahad",
      "meaning": "The Unique",
      "appearances": "twice in the Quran",
      "arabicText": "قُلۡ هُوَ ٱللَّهُ أَحَدٌ",
      "translation": "Say, \"He is Allah, [who is] One,\"",
      "quranReference": "Quran (112:1)",
      "description": "The name Al Ahad describes Allah's absolute oneness and uniqueness. It is a more emphasized form of the previous name, Al Wahid. While the former may address Allah being numerically one, this name highlights Allah's individual uniqueness and the fact that no one else can compare to or be like Him. Therefore, none is worthy of worship except for Him. From this name, we can also reflect on our own unique positive qualities that Allah gave us and be grateful for them.",
      "additionalInfo": "A dua with this name: اللّهُـمَّ إِنِّـي أَسْأَلُـكَ يا اللهُ بِأَنَّـكَ الواحِـدُ الأَحَـد الصَّـمَدُ الَّـذي لَـمْ يَلِـدْ وَلَمْ يولَدْ وَلَمْ يَكـنْ لَهُ كُـفُواً أَحَـد أَنْ تَغْـفِرْ لي ذُنـوبي إِنَّـكَ أَنْـتَ الغَفـورُ الرَّحِّـيم (\"O Allah, I ask You. O Allah, You are the One, the Only, Self-Sufficient Master, Who was not begotten and begets not, and none is equal to Him. Forgive me my sins, surely you are Forgiving, Merciful.\") - Sunan an-Nasa'i 1301"
    },
    {
      "number": 68,
      "name": "As Samad",
      "meaning": "The Satisfier of Needs",
      "appearances": "once in the Quran",
      "arabicText": "قُلْ هُوَ ٱللَّهُ أَحَدٌ ٱللَّهُ ٱلصَّمَدُ",
      "translation": "Say, \"He is Allah, [who is] One, Allah, the Eternal Refuge.\"",
      "quranReference": "Quran (112:1-2)",
      "description": "The name As Samad describes Allah as the only one who is capable of being totally self-sufficient while also provided for others. As creation, our nature consists of neediness and we are constantly dependent on Allah for assistance. Therefore, in times of need, we must turn to the one who is completely free of needs Himself. There is no power except for Allah, and every little form of help comes from Him."
    },
    {
      "number": 69,
      "name": "Al Qaadir",
      "meaning": "The Capable",
      "appearances": "12 times in the Quran",
      "arabicText": "قُلِ ٱللَّهُمَّ مَـٰلِكَ ٱلْمُلْكِ تُؤْتِى ٱلْمُلْكَ مَن تَشَآءُ وَتَنزِعُ ٱلْمُلْكَ مِمَّن تَشَآءُ وَتُعِزُّ مَن تَشَآءُ وَتُذِلُّ مَن تَشَآءُ ۖ بِيَدِكَ ٱلْخَيْرُ ۖ إِنَّكَ عَلَىٰ كُلِّ شَىْءٍۢ قَدِيرٌۭ",
      "translation": "Say, 'O Allah, Owner of Sovereignty, You give sovereignty to whom You will and You take sovereignty away from whom You will. You honor whom You will and You humble whom You will. In Your hand is [all] good. Indeed, You are over all things competent.'",
      "quranReference": "Quran (3:26)",
      "description": "The name Al Qaadir describes Allah's quality of being the one who measures out decrees, and who determines all matters. This name should be an inspiration to us that we shouldn't lose hope of having our dreams fulfilled, since Allah is the one who can make anything happen. We just need to ask Him, who is the determiner of all affairs, with conviction. When we ask for help, we shouldn't self-impose restrictions on our duas and should have the mentality that we can ask for even the most seemingly impossible of things."
    },
    {
      "number": 70,
      "name": "Al Muqtadir",
      "meaning": "The Powerful Determiner",
      "appearances": "4 times in the Quran",
      "arabicText": "كَذَّبُواْ بِـَٔايَٰتِنَا كُلِّهَا فَأَخَذۡنَٰهُمۡ أَخۡذَ عَزِيزٖ مُّقۡتَدِرٍ",
      "translation": "They denied Our signs, all of them, so We seized them with a seizure of one Exalted in Might and Perfect in Ability.",
      "quranReference": "Quran (54:42)",
      "description": "The name Al Muqtadir is a more emphatic version of the previous name of Allah, Al Qaadir. While both names reflect Allah's power, this name emphasizes that Allah is the All-Determiner, and is the most powerful. As an example, Imam Al-Ghazali states that Allah is the one who determines when Judgement Day will occur and could make it happen at any moment that He wishes. He has made everything with an appointed time, and nothing can interfere with Allah's plan. From this name, we are reminded that not everything is up to us. We must try our best to accomplish what is important to us, but in the end, we must leave our trust in Allah to help us actually achieve it if He thinks it is truly best for us."
    },
    {
      "number": 71,
      "name": "Al Muqaddim",
      "meaning": "The Expediter",
      "appearances": "Does not directly appear in the Quran",
      "arabicText": "",
      "translation": "",
      "quranReference": "",
      "description": "The name Al Muqaddim describes Allah's ability to bring someone close to Him and promote them in rank through guidance and mercy.",
      "additionalInfo": "This name appears in a dua: اللَّهُمَّ اغْفِرْ لِي خَطِيئَتِي وَجَهْلِي وَإِسْرَافِي فِي أَمْرِي وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي اللَّهُمَّ اغْفِرْ لِي جِدِّي وَهَزْلِي وَخَطَئِي وَعَمْدِي وَكُلُّ ذَلِكَ عِنْدِي اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ وَأَنْتَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ (\"O Allah, forgive me my faults, my ignorance, my immoderation in my concerns. And you are better aware (of my affairs) than myself. O Allah, grant me forgiveness (of the faults which I committed) seriously or otherwise (and which I committed inadvertently and deliberately. All these (failings) are in me. O Allah, grant me forgiveness from the fault which I did in haste or deferred, which I committed in privacy or in public and You are better aware of (them) than myself. You are the First and the Last and over all things You are Omnipotent.\") - Sahih Muslim 2719a & Sahih al-Bukhari 6398"
    },
    {
      "number": 72,
      "name": "Al Muakhkhir",
      "meaning": "The Delayer",
      "appearances": "Does not directly appear in the Quran",
      "arabicText": "",
      "translation": "",
      "quranReference": "",
      "description": "The name Al Mu'akhkhir complements the previous name, Al Muqaddim, by showing that just as Allah can bring us close to Him, He can also push away and increase the ignorance of those who continuously refuse to believe in the truth. Another interpretation of this name is that Allah also delays us with hardship sometimes in order to test our faith. We can take for example, that even the prophets, who were closest to Allah, were delayed or tested by Him. One instance is Prophet Ayyub (AS), who lost everything including his wealth, health, and all of his children. This shows us that we shouldn't despair when we face hardship, as Allah doesn't burden us with more than we can bear and He tests us ultimately for our own good so that our rank can be raised closer to Him.",
      "additionalInfo": "Refer to the dua in the previous name (Al Muqaddim)"
    },
    {
      "number": 73,
      "name": "Al Awwal",
      "meaning": "The First",
      "appearances": "once in the Quran",
      "arabicText": "هُوَ ٱلۡأَوَّلُ وَٱلۡأٓخِرُ وَٱلظَّـٰهِرُ وَٱلۡبَاطِنُۖ وَهُوَ بِكُلِّ شَيۡءٍ عَلِيمٌ",
      "translation": "He is the First and the Last, the Ascendant and the Intimate, and He is, of all things, Knowing.",
      "quranReference": "Quran (57:3)",
      "description": "The name Al Awwal highlights that Allah existed before anything else. He is the beginning of everything, and He is the creator of everything. Thus, He is the only one that we should turn to at all times. This name is closely tied to the next one, Al Aakhir, because since there is a first, there must be a last. These two names show that in the race of life, no matter what detours we take, we all start from Allah and our end will be going back to Him."
    },
    {
      "number": 74,
      "name": "Al Aakhir",
      "meaning": "The Last",
      "appearances": "once in the Quran (see slide for Al Awwal for ayat)",
      "arabicText": "هُوَ ٱلۡأَوَّلُ وَٱلۡأٓخِرُ وَٱلظَّـٰهِرُ وَٱلۡبَاطِنُۖ وَهُوَ بِكُلِّ شَيۡءٍ عَلِيمٌ",
      "translation": "He is the First and the Last, the Ascendant and the Intimate, and He is, of all things, Knowing.",
      "quranReference": "Quran (57:3)",
      "description": "The name Al Aakhir is corresponding to Al Awwal and demonstrates that we will all eventually to return to Allah, since He is the beginning and end of all existence.",
      "additionalInfo": "In context of the dua to be recited before sleeping: اللَّهُمَّ رَبَّ السَّمَوَاتِ وَرَبَّ الأَرْضِ وَرَبَّ الْعَرْشِ الْعَظِيمِ رَبَّنَا وَرَبَّ كُلِّ شَىْءٍ فَالِقَ الْحَبِّ وَالنَّوَى وَمُنْزِلَ التَّوْرَاةِ وَالإِنْجِيلِ وَالْفُرْقَانِ أَعُوذُ بِكَ مِنْ شَرِّ كُلِّ شَىْءٍ أَنْتَ آخِذٌ بِنَاصِيَتِهِ اللَّهُمَّ أَنْتَ الأَوَّلُ فَلَيْسَ قَبْلَكَ شَىْءٌ وَأَنْتَ الآخِرُ فَلَيْسَ بَعْدَكَ شَىْءٌ وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَىْءٌ وَأَنْتَ الْبَاطِنُ فَلَيْسَ دُونَكَ شَىْءٌ اقْضِ عَنَّا الدَّيْنَ وَأَغْنِنَا مِنَ الْفَقْرِ (\"O Allah. the Lord of the Heavens and the Lord of the Earth and Lord of the Magnificent Throne, our Lord, and the Lord of evervthing, the Splitter of the grain of corn and the datestone (or fruit kernal), the Revealer of Torah and Injil (Bible) and Criterion (the Holy Qur'an), I seek refuge in Thee from the evil of every - thing Thou art to sieze by the forelock (Thou hast perfect control over it). O Allah, Thou art the First, there is naught before Thee, and Thou art the Last and there is naught after Thee, and Thou art Evident and there is nothing above Thee, and Thou art Innermost and there is nothing beyond Thee. Remove the burden of debt from us and relieve us from want.\") - Sahih Muslim 2713a"
    },
    {
      "number": 75,
      "name": "Adh Dhaahir",
      "meaning": "The Manifest",
      "appearances": "once in the Quran",
      "arabicText": "هُوَ ٱلْأَوَّلُ وَٱلْـَٔاخِرُ وَٱلظَّـٰهِرُ وَٱلْبَاطِنُ ۖ وَهُوَ بِكُلِّ شَىْءٍ عَلِيمٌ",
      "translation": "He is the First and the Last, the Ascendant and the Intimate, and He is, of all things, Knowing.",
      "quranReference": "Quran (57:3)",
      "description": "The name Adh Dhaahir is paired with the next name, Al Baatin, in order to illustrate that Allah is both manifest and hidden. This name specifically shows that the evidence of Allah's existence is clearly shown through His signs, His creations, and His book (the Quran). For those that believe in Him, it is very obvious that Allah exists. However, for those that cannot believe unless they see, then they will miss Him."
    },
    {
      "number": 76,
      "name": "Al Baatin",
      "meaning": "The Hidden One",
      "appearances": "once in the Quran",
      "arabicText": "هُوَ ٱلْأَوَّلُ وَٱلْـَٔاخِرُ وَٱلظَّـٰهِرُ وَٱلْبَاطِنُ ۖ وَهُوَ بِكُلِّ شَىْءٍ عَلِيمٌ",
      "translation": "He is the First and the Last, the Ascendant and the Intimate, and He is, of all things, Knowing.",
      "quranReference": "Quran (57:3)",
      "description": "The name Al Baatin corresponds to Az Zhaahir and shows that while Allah's existence is apparent through everything around us, we cannot see Him physically. He is hidden in plain sight, but those who are ignorant will not be able to comprehend His existence even though it is right in front of them."
    },
    {
      "number": 77,
      "name": "Al Waali",
      "meaning": "The Patron",
      "appearances": "Doesn't appear in the Quran, but is described",
      "arabicText": "ٱللَّهُ وَلِيُّ ٱلَّذِينَ ءَامَنُواْ يُخۡرِجُهُم مِّنَ ٱلظُّلُمَٰتِ إِلَى ٱلنُّورِۖ وَٱلَّذِينَ كَفَرُوٓاْ أَوۡلِيَآؤُهُمُ ٱلطَّـٰغُوتُ يُخۡرِجُونَهُم مِّنَ ٱلنُّورِ إِلَى ٱلظُّلُمَٰتِۗ أُوْلَـٰٓئِكَ أَصۡحَٰبُ ٱلنَّارِۖ هُمۡ فِيهَا خَٰلِدُونَ",
      "translation": "Allah is the ally of those who believe. He brings them out from darknesses into the light. And those who disbelieve – their allies are Taghut. They take them out of the light into darknesses. Those are the companions of the Fire; they will abide eternally therein.",
      "quranReference": "Quran (2:257)",
      "description": "The name Al Waali (not to be confused with Al Waliyy) refers to Allah's quality of being a ruler and guardian. According to Imam Ghazali, this means that Allah displays the three qualities of a true ruler: organization, power, and action. Allah is the best of planners, is the most powerful being, and is in charge of all affairs. Much like several previous names, this name should reassure us that everything is in Allah's hands and He definitely will not decree anything that will harm us."
    },
    {
      "number": 78,
      "name": "Al Muta'aali",
      "meaning": "The Supremely Exalted",
      "appearances": "Doesn't appear in the Quran, but is described",
      "arabicText": "عَٰلِمُ ٱلۡغَيۡبِ وَٱلشَّهَٰدَةِ ٱلۡكَبِيرُ ٱلۡمُتَعَالِ",
      "translation": "[He is] Knower of the unseen and the witnessed, the Grand, the Exalted.",
      "quranReference": "Quran (13:9)",
      "description": "The name Al Muta'aali is an emphasized version of the name Al Aliyy (The Exalted) and Al A'laa (not one of the 99 names, but meaning The Most High/Exalted). Al Aliyy, Al A'laa, and Al Muta'aali, respectively, are in increasing order of exaggeration. The combination of these three names shows the elevated status of Allah. He is not just superior in one aspect, but in all aspects such as might, wisdom, knowledge, judgement, power, mercy, etc. He is beyond the extent of our imaginations and our minds are too small to comprehend His countenance."
    },
    {
      "number": 79,
      "name": "Al Barr",
      "meaning": "The Source of Goodness",
      "appearances": "once in the Quran",
      "arabicText": "إِنَّا كُنَّا مِن قَبۡلُ نَدۡعُوهُۖ إِنَّهُۥ هُوَ ٱلۡبَرُّ ٱلرَّحِيمُ",
      "translation": "Indeed, we used to supplicate Him before. Indeed, it is He who is the Beneficent, the Merciful.",
      "quranReference": "Quran (52:28)",
      "description": "The name Al Barr describes Allah's kindness, generosity, and mercy towards His creations. These qualities of His are boundless and far greater than we can imagine, such that we will never be able to express enough gratitude for all of the gifts Allah has given us. He could have made Islam difficult, but He made it incredibly easy and clear for us to follow His commands and worship Him. Not only does He reward us for our good deeds, but He also multiplies the reward for us manyfold and grants us the reward for any good that we thought of or intended even if we didn't actually commit to it. We should try our best to pay forward this kindness by treating everyone and everything around us with the same compassion."
    },
    {
      "number": 80,
      "name": "At Tawwaab",
      "meaning": "The Ever-Pardoning",
      "appearances": "11 times in the Quran",
      "arabicText": "إِلَّا ٱلَّذِينَ تَابُواْ وَأَصۡلَحُواْ وَبَيَّنُواْ فَأُوْلَـٰٓئِكَ أَتُوبُ عَلَيۡهِمۡ وَأَنَا ٱلتَّوَّابُ ٱلرَّحِيمُ",
      "translation": "Except for those who repent and correct themselves and make evident [what they concealed]. Those – I will accept their repentance, and I am the Accepting of repentance, the Merciful.",
      "quranReference": "Quran (2:160)",
      "description": "The name At Tawwaab is often associated with Allah's forgiveness. However, it also shows that not only should we always turn to Him even after making a mistake, but Allah also turns to us to accept our repentance and hear our prayers. Even when we knowingly transgress, Allah still turns to us and listens to us out of His infinite mercy. Allah loves to forgive, and even pardons minor sins without us even asking for forgiveness. Whereas we struggle to forgive even the slightest of grudges, Allah's mercy flows freely and unconditionally beyond our comprehension."
    },
    {
      "number": 81,
      "name": "Al Muntaqim",
      "meaning": "The Avenger",
      "appearances": "Does not directly appear in the Quran, but is described",
      "arabicText": "يَوۡمَ نَبۡطِشُ ٱلۡبَطۡشَةَ ٱلۡكُبۡرَىٰٓ إِنَّا مُنتَقِمُونَ",
      "translation": "The Day We will strike with the greatest assault, indeed, We will take retribution.",
      "quranReference": "Quran (44:16)",
      "description": "The name Al Muntaqim describes Allah's ability to bestow punishment based on just cause. Some incidents that are examples of this are Firaun drowning as a result of his cruel treatment of the Bani Israel and refusal to accept Allah as the only deity, or the disobedient people of Nuh (AS)'s nation drowning in the flood. Even Nuh (AS)'s own son was not spared from the consequences of his disobedience. This shows that although the prophets are chosen by Allah to convey His message, He does not show favoritism towards them and delivers retribution justly according to everyone's deeds. Thus, we should be mindful of our own deeds so that we can be saved from the punishment in this life and the hereafter."
    },
    {
      "number": 82,
      "name": "Al 'Afuww",
      "meaning": "The Pardoner",
      "appearances": "five times in the Quran",
      "arabicText": "إِن تُبۡدُواْ خَيۡرًا أَوۡ تُخۡفُوهُ أَوۡ تَعۡفُواْ عَن سُوٓءٖ فَإِنَّ ٱللَّهَ كَانَ عَفُوّٗا قَدِيرًا",
      "translation": "(Even though you have the right to speak evil if you are wronged), if you keep doing good -whether openly or secretly -or at least pardon the evil (then that is the attribute of Allah). Allah is All-Pardoning and He has all the power to chastise.",
      "quranReference": "Quran (4:149)",
      "description": "The name Al 'Afuww shows that Allah not only forgives His servants, but also erases all traces of our sins. While forgiveness implies that although nullified, the deed is still recorded, a pardon means that the sin is completely eliminated. By doing this, Allah purifies us and gives us a clean slate moving forward after each sin is forgiven. While we as humans have a hard time forgiving, much less forgetting when someone wrongs us even slightly, Allah's capacity to forgive transcends the boundaries of our expectations. Even if we might think we are irredeemable, Allah is still willing to forgive us as long as our intention is pure and we sincerely ask for His forgiveness."
    },
    {
      "number": 83,
      "name": "Ar Ra'oof",
      "meaning": "The Most Kind",
      "appearances": "11 times in the Quran",
      "arabicText": "وَلَوۡلَا فَضۡلُ ٱللَّهِ عَلَيۡكُمۡ وَرَحۡمَتُهُۥ وَأَنَّ ٱللَّهَ رَءُوفٞ رَّحِيمٞ",
      "translation": "And had it not been for the Grace of Allah upon you and His mercy, and that Allah is Ever Compassionate, Ever-Merciful (you had been the losers).",
      "quranReference": "Quran (24:20)",
      "description": "The name Ar Ra'oof can be considered a more extreme form of the name Ar Raheem (The Merciful). The difference between these is that Rahma generally comes after some sort of calamity, while Ra'fa comes before. This means that not only does Allah reward us for hardships we face, but He also protects us from encountering tragedy. Oftentimes, we might face an unfavorable circumstance and question why it is happening to us, but Allah may have prevented us from encountering a far worse outcome through a less severe trial. He also warns us so that we don't go through difficulty. However, we are the ones who often overlook these warnings and cause harm to ourselves."
    },
    {
      "number": 84,
      "name": "Maalik-ul-Mulk",
      "meaning": "The Owner of the Dominion",
      "appearances": "once in the Quran",
      "arabicText": "قُلِ ٱللَّهُمَّ مَٰلِكَ ٱلۡمُلۡكِ تُؤۡتِي ٱلۡمُلۡكَ مَن تَشَآءُ وَتَنزِعُ ٱلۡمُلۡكَ مِمَّن تَشَآءُ وَتُعِزُّ مَن تَشَآءُ وَتُذِلُّ مَن تَشَآءُۖ بِيَدِكَ ٱلۡخَيۡرُۖ إِنَّكَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ",
      "translation": "Say, \"O Allah, Owner of Sovereignty, You give sovereignty to whom You will and You take sovereignty away from whom You will. You honor whom You will and You humble whom You will. In Your hand is [all] good. Indeed, You are over all things competent.\"",
      "quranReference": "Quran (3:26)",
      "description": "The name Maalik-ul-Mulk describes Allah's absolute power and might. Maalik (owner) is not to be confused with Malik (king), which is also a previous name. He has utmost sovereignty and faces no limitations, so He can easily implement everything according to His will. This name reminds us that if we have Allah on our side, who is so supremely powerful, then no one can overcome us. On the other hand, this name should also cause us to show humility since Allah is the owner of everything. All of our wealth and possessions belong to Allah, so we shouldn't feel a sense of loftiness because of them. No matter how much influence one has in this world, no one is more powerful than Allah."
    },
    {
      "number": 85,
      "name": "Dhul Jalaali Wal Ikraam",
      "meaning": "Possessor of Glory and Honor",
      "appearances": "two times in the Quran",
      "arabicText": "وَيَبۡقَىٰ وَجۡهُ رَبِّكَ ذُو ٱلۡجَلَٰلِ وَٱلۡإِكۡرَامِ",
      "translation": "And there will remain the Face of your Lord, Owner of Majesty and Honor.",
      "quranReference": "Quran (55:27)",
      "description": "The name Dhul Jalaali wal Ikraam describes Allah as being the one who has utmost Jalaal, meaning majesty or glory, and Karam, meaning generosity or honor. In the above ayat, these attributes are shown to characterize the face of Allah. This doesn't necessarily mean His physical face, but instead represents His countenance or qualities. Another important thing to note is the order of majesty followed by honor. This shows that to study Allah's attributes, we must first develop \"taqwa\" by recognizing His strength, power, and judgement. Then, we should be aware of His kindness, forgiveness, and mercy. In order to truly worship Allah, we cannot only look at His mercy or strength as standalone attributes. Only when we recognize both sides can we both love Allah and fear Him at the same time."
    },
    {
      "number": 86,
      "name": "Al Muqsit",
      "meaning": "The Requiter",
      "appearances": "Does not directly appear in the Quran, but is described",
      "arabicText": "وَنَضَعُ ٱلۡمَوَٰزِينَ ٱلۡقِسۡطَ لِيَوۡمِ ٱلۡقِيَٰمَةِ فَلَا تُظۡلَمُ نَفۡسٞ شَيۡـٔٗاۖ وَإِن كَانَ مِثۡقَالَ حَبَّةٖ مِّنۡ خَرۡدَلٍ أَتَيۡنَا بِهَاۗ وَكَفَىٰ بِنَا حَٰسِبِينَ",
      "translation": "The Day We will strike with the greatest assault, indeed, We will take retribution.",
      "quranReference": "Quran (44:16)",
      "description": "The name Al Muqsit, similar to Al Adl (The Embodiment of Justice) and Al Hakam (The Impartial Judge), shows that Allah justly balances each crime with its punishment. Allah doesn't wrong anyone and returns consequences of our actions whether they are good or bad. Allah's judgement is fair, and He loves those who act justly as well. We should try our best to act fairly towards others, and every time we have a hard time forgiving someone, it can help to remember that others may similarly have grudges towards us that we would want them to forgive us for."
    },
    {
      "number": 87,
      "name": "Al Jaami'",
      "meaning": "The Gatherer",
      "appearances": "Does not directly appear in the Quran, but is described",
      "arabicText": "رَبَّنَآ إِنَّكَ جَامِعُ ٱلنَّاسِ لِيَوۡمٖ لَّا رَيۡبَ فِيهِۚ إِنَّ ٱللَّهَ لَا يُخۡلِفُ ٱلۡمِيعَادَ",
      "translation": "Our Lord, surely You will gather the people for a Day about which there is no doubt. Indeed, Allah does not fail in His promise.",
      "quranReference": "Quran (3:9)",
      "description": "The name Al Jaami' describes Allah's ability to collect or gather things together whether they are similar or not. An example of this is how us as humans where created by Him; we are composed of so many complex parts, all working together as one to keep us alive and healthy. Allah also composed the universe out of stars, galaxies, planets, and so many different types of materials and organisms. This name also can refer to the way that Allah will gather us on the Day of Judgement. Therefore, it serves a reminder that we will return to Him and should remain watchful over our deeds since they will eventually be accounted for."
    },
    {
      "number": 88,
      "name": "Al Ghaniyy",
      "meaning": "The Rich",
      "appearances": "18 times in the Quran",
      "arabicText": "وَرَبُّكَ ٱلْغَنِىُّ ذُو ٱلرَّحْمَةِ ۚ إِن يَشَأْ يُذْهِبْكُمْ وَيَسْتَخْلِفْ مِنۢ بَعْدِكُم مَّا يَشَآءُ كَمَآ أَنشَأَكُم مِّن ذُرِّيَّةِ قَوْمٍ ءَاخَرِينَ",
      "translation": "And your Lord is the Free of need, the possessor of mercy. If He wills, he can do away with you and give succession after you to whomever He wills, just as He produced you from the descendants of another people.",
      "quranReference": "Quran (6:133)",
      "description": "The name Al Ghaniyy shows that Allah's resources are unlimited and giving us blessings doesn't diminish Him in any way. So, we shouldn't ever feel envious that Allah gave someone else something, since He can give us that and much more. Another interpretation is that Allah is not only rich in a monetary sense, but also in every way such as knowledge, time, might, and influence. We should ask Allah for what we need, however we should also be grateful for the countless ways that He has already blessed us."
    },
    {
      "number": 89,
      "name": "Al Mughniyy",
      "meaning": "The Enricher",
      "appearances": "Does not directly appear in the Quran, but is described",
      "arabicText": "وَأَنَّهُۥ هُوَ أَغْنَىٰ وَأَقْنَىٰ",
      "translation": "And that it is He who enriches and suffices.",
      "quranReference": "Quran (53:48)",
      "description": "The name Al Mughniyy is connected to the previous name Al Ghaniyy, and implies that Allah is free from any needs Himself and is the only one who can grant us our needs. It reminds us that when asking from Allah, we should start by being grateful for the enumerable ways He has enriched us already in all aspects (not just a monetary sense). Instead of focusing only on what we need from Allah, we should emphasize that He is the only one who can provide it for us. Since we should strive to emulate Allah's names in our daily lives, we can try to give back to those who are in less favorable situations than ourselves. By enriching others, we can enrich ourselves. Allah has told us that by giving to others what is dearest to us, we are actually enriching ourselves in good deeds and wealth in the Hereafter."
    },
    {
      "number": 90,
      "name": "Al Maani'",
      "meaning": "The Preventer",
      "appearances": "Does not directly appear in the Quran, but is described",
      "arabicText": "",
      "translation": "",
      "quranReference": "",
      "description": "The name Al Maani' represents that Allah has the authority to withhold whatever He wishes. It can also mean that Allah can withhold something from happening for our own protection from something that we do not know. Allah doesn't give us everything we desire out of His wisdom and compassion, similar to how a parent treats their child. Thus, instead of complaining, we should be patient, focus on everything that He has already given us, and have the mentality that if something is truly beneficial for us, then Allah will surely give it to us.",
      "additionalInfo": "In context of a dua that the Prophet (SAW) used to recite after each compulsory prayer: لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهْوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ اللَّهُمَّ لاَ مَانِعَ لِمَا أَعْطَيْتَ وَلاَ مُعْطِيَ لِمَا مَنَعْتَ وَلاَ يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ (\"There is no Deity but Allah, Alone, no Partner to Him. His is the Kingdom and all praise, and Omnipotent is he. O Allah! Nobody can hold back what you gave, nobody can give what You held back, and no struggler's effort can benefit against You\") - Sahih al-Bukhari 844"
    },
    {
      "number": 91,
      "name": "Adh Dhaar",
      "meaning": "The Distresser",
      "appearances": "Does not directly appear in the Quran, but is described",
      "arabicText": "وَلَا تَدۡعُ مِن دُونِ ٱللَّهِ مَا لَا يَنفَعُكَ وَلَا يَضُرُّكَۖ فَإِن فَعَلۡتَ فَإِنَّكَ إِذٗا مِّنَ ٱلظَّـٰلِمِينَ",
      "translation": "And do not invoke besides Allah that which neither benefits you nor harms you, for if you did, then indeed you would be of the wrongdoers.'",
      "quranReference": "Quran (10:106)",
      "description": "The name Ad Dhaar is a reminder that while Allah is generous and gives us countless blessings, He also is the one who determines when harm will befall a person, whether as a punishment or as a test. However, when faced with calamity, we must remember that Allah doesn't give us hardship in vain, and we are able to purify ourselves and receive rewards through these trials. We should seek forgiveness and be patient when encountering difficulty, and remain steadfast. We are also reminded that Allah is merciful, but He will also return to us the consequences of our actions."
    },
    {
      "number": 92,
      "name": "An Naafi'",
      "meaning": "The Benefactor",
      "appearances": "Does not directly appear in the Quran, but is described",
      "arabicText": "وَلَا تَدۡعُ مِن دُونِ ٱللَّهِ مَا لَا يَنفَعُكَ وَلَا يَضُرُّكَۖ فَإِن فَعَلۡتَ فَإِنَّكَ إِذٗا مِّنَ ٱلظَّـٰلِمِينَ",
      "translation": "And do not invoke besides Allah that which neither benefits you nor harms you, for if you did, then indeed you would be of the wrongdoers.'",
      "quranReference": "Quran (10:106)",
      "description": "The name An Naafi' is the counterpart to Ad Dhaar, and implies that although Allah is the one who punishes the disobedient, He is also the one who grants us so many blessings. By taking these two names together, it shows the complementary nature of Allah. We shouldn't attribute any evil or bad conditions to Allah, since He acts justly and according to His greater wisdom. When we view any negative circumstances, we should always also consider the good things that we still have and remain grateful."
    },
    {
      "number": 93,
      "name": "An Noor",
      "meaning": "The Illuminator",
      "appearances": "The word \"noor\" appears more than 40 times in the Quran",
      "arabicText": "يَـٰٓأَهۡلَ ٱلۡكِتَٰبِ قَدۡ جَآءَكُمۡ رَسُولُنَا يُبَيِّنُ لَكُمۡ كَثِيرٗا مِّمَّا كُنتُمۡ تُخۡفُونَ مِنَ ٱلۡكِتَٰبِ وَيَعۡفُواْ عَن كَثِيرٖۚ قَدۡ جَآءَكُم مِّنَ ٱللَّهِ نُورٞ وَكِتَٰبٞ مُّبِينٞ",
      "translation": "O People of the Scripture, there has come to you Our Messenger making clear to you much of what you used to conceal of the Scripture and overlooking much. There has come to you from Allah a light and a clear Book.",
      "quranReference": "Quran (5:15)",
      "description": "The name An Noor describes Allah's countenance as such that His magnificence is too bright and great for us to be able to bear seeing. Another interpretation is that He is the one that provides the light of knowledge, and His light reveals all that we try to hide. He illuminates the path to His guidance, and without His help, we would be confused and misguided. We are also reminded here that no one can hide anything from Allah, as He is As Samee' (The All-Hearing) and Al Baseer (The All-Seeing). Each of us has our own light that benefits and guides others around us, drawing them closer to Allah. On the Day of Judgement, it is this light that will illuminate our path on the Siraat to Jannah, so we should always ask Allah to brighten our light of goodness.",
      "additionalInfo": "Dua to ask Allah for light: Sahih Bukhari 6316"
    },
    {
      "number": 94,
      "name": "Al Haadi",
      "meaning": "The Guide",
      "appearances": "Does not directly appear in the Quran, but is described",
      "arabicText": "إِنَّكَ لَا تَهۡدِي مَنۡ أَحۡبَبۡتَ وَلَٰكِنَّ ٱللَّهَ يَهۡدِي مَن يَشَآءُۚ وَهُوَ أَعۡلَمُ بِٱلۡمُهۡتَدِينَ",
      "translation": "Indeed, [O Muhammad], you do not guide whom you like, but Allah guides whom He wills. And He is most knowing of the [rightly] guided.",
      "quranReference": "Quran (28:56)",
      "description": "The name Al Haadi is related to An Noor, since the light helps to guide the way. Allah has sent various means to guide us, such as the Quran, the prophets and messengers, and the hadiths of His last messenger: the Prophet Muhammad (SAW). We must study both the hadiths and the Quran in order to receive full guidance, and must not neglect either one in favor of the other since both were sent by Allah for the purpose of instructing us. Allah is the only source of guidance, but Prophet Muhammad (SAW) served a role similar to a doctor, in that he advised us based on Allah's commands that we need to follow. However, it is up to us whether we implement these into our lives and benefit from this guidance or not."
    },
    {
      "number": 95,
      "name": "Al Badee'",
      "meaning": "The Incomparable Originator",
      "appearances": "two times in the Quran",
      "arabicText": "بَدِيعُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ أَنَّىٰ يَكُونُ لَهُۥ وَلَدٞ وَلَمۡ تَكُن لَّهُۥ صَٰحِبَةٞۖ وَخَلَقَ كُلَّ شَيۡءٖۖ وَهُوَ بِكُلِّ شَيۡءٍ عَلِيمٞ",
      "translation": "[He is] Originator of the heavens and the earth. How could He have a son when He does not have a companion and He created all things? And He is, of all things, Knowing.",
      "quranReference": "Quran (6:101)",
      "description": "The name Al Badee', relating back to Al Awwal (The First), describes Allah as being the both the original being and the originator of everything in existence. This can also be considered a name of creation, alongside Al Khaliq (The Creator), Al Bari' (The Maker), and Al Musawwir (The Fashioner). Nothing predates Him and no one has the capability or power to do what He can. Allah is completely unique and dissimilar to anything else, and He has also created each of us to be unique from other humans. From our fingerprints to our personalities and experiences, each one of us is different and special. Rather than feeling negative about standing out, we should strive to improve ourselves and distinguish ourselves in the sight of Allah."
    },
    {
      "number": 96,
      "name": "Al Baaqi",
      "meaning": "The Everlasting",
      "appearances": "Does not directly appear in the Quran",
      "arabicText": "مَا عِندَكُمۡ يَنفَدُ وَمَا عِندَ ٱللَّهِ بَاقٖۗ وَلَنَجۡزِيَنَّ ٱلَّذِينَ صَبَرُوٓاْ أَجۡرَهُم بِأَحۡسَنِ مَا كَانُواْ يَعۡمَلُونَ",
      "translation": "Whatever you have will end, but what Allah has is lasting. And We will surely give those who were patient their reward according to the best of what they used to do.",
      "quranReference": "Quran (16:96)",
      "description": "The name Al Baaqi shows that Allah has always been and will always be present. Unlike Al Awwal (The First) and Al Aakhir (The Last), this name shows that Allah transcends time and is not limited by it in any way. His existence is necessary for all other things to exist, or in other words, we are all dependent on Him. In contrast, our lives are finite and the time we have is quickly waning. As a result, this should serve as a reminder that we must take advantage of the time we have left for our benefit in the Hereafter."
    },
    {
      "number": 97,
      "name": "Al Waarith",
      "meaning": "The Inheritor",
      "appearances": "three times in the Quran",
      "arabicText": "وَكَمْ أَهْلَكْنَا مِن قَرْيَةٍۭ بَطِرَتْ مَعِيشَتَهَا ۖ فَتِلْكَ مَسَـٰكِنُهُمْ لَمْ تُسْكَن مِّنۢ بَعْدِهِمْ إِلَّا قَلِيلًۭا ۖ وَكُنَّا نَحْنُ ٱلْوَٰرِثِينَ",
      "translation": "And how many a city have We destroyed that was insolent in its [way of] living, and those are their dwellings which have not been inhabited after them except briefly. And it is We who were the inheritors.",
      "quranReference": "Quran (28:58)",
      "description": "The name Al Waarith shows that since everything that we have belongs to Allah, after our lives end, all of it will return back to Him; the true owner. It also highlights that Allah is everlasting (Al Baaqi) and will always exist after all of us pass away. Allah has no partners, and thus He is the sole inheritor and owner of everything. None of the worldly possessions that we hoard and covet in this life will stay with us forever, so we should instead place our importance on our deeds which are the only thing that will stay with us after death."
    },
    {
      "number": 98,
      "name": "Ar Rasheed",
      "meaning": "The Infallible Teacher",
      "appearances": "Does not directly appear in the Quran, but is described",
      "arabicText": "إِذۡ أَوَى ٱلۡفِتۡيَةُ إِلَى ٱلۡكَهۡفِ فَقَالُواْ رَبَّنَآ ءَاتِنَا مِن لَّدُنكَ رَحۡمَةٗ وَهَيِّئۡ لَنَا مِنۡ أَمۡرِنَا رَشَدٗا",
      "translation": "[Mention] when the youths retreated to the cave and said, 'Our Lord, grant us from Yourself mercy and prepare for us from our affair right guidance.'",
      "quranReference": "Quran (18:10)",
      "description": "The name Ar Rasheed implies that Allah is the one who provides the correct guidance. While this is similar to Al Haadi (The Guide), Ar Rasheed emphasizes this by eliminating the possibility of misguidance. He made Islam easy for us to understand so that we can learn and follow the path to guidance. When facing a problem, we should always ask Allah to guide our judgment so that we make the right choice on how to proceed, since He is the source of right guidance and has unparalleled wisdom."
    },
    {
      "number": 99,
      "name": "As Saboor",
      "meaning": "The Patient",
      "appearances": "Does not directly appear in the Quran",
      "arabicText": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱسۡتَعِينُواْ بِٱلصَّبۡرِ وَٱلصَّلَوٰةِۚ إِنَّ ٱللَّهَ مَعَ ٱلصَّـٰبِرِينَ",
      "translation": "O you who have believed, seek help through patience and prayer. Indeed, Allah is with the patient.",
      "quranReference": "Quran (2:153)",
      "description": "The name As Saboor describes the immense patience that Allah treats us with. No matter how many mistakes we make, He doesn't immediately destroy or punish us, but instead continues to give us chances to ask forgiveness and turn back to Him. Allah is patient Himself, and loves those who are patient. Therefore, we should practice this quality by abstaining from our desires that may seem enticing but will harm us in reality. We should also strive to retain patience when someone or something upsets us, or when a situation is unfavorable to us. Instead of becoming angry, using foul language, or falling into sorrow, it is better to endure whatever comes our way with patience.",
      "additionalInfo": "\"The believer who mixes with people and bears their annoyance with patience will have a greater reward than the believer who does not mix with people and does not put up with their annoyance.\" - Sahih (Darussalam) Sunan Ibn Majah 4032"
    }
  ]
}
